DNA-2019/CloudC-publish/Demos.org
* JMM
** Two threads in Java sharing memory
** [[file:weak-memory/TSO.java][TSO.java]]
#+BEGIN_SRC bash
java -ea -server TSO
#+END_SRC
* Erlang
** Simple Ping Pong applicatoin
** [[file:erlang/mp.erl][message-passing.erl]]
** Start pong server
#+BEGIN_SRC bash
erl -sname pong
mp: start_pong().
#+END_SRC
