DNA-2019/CloudC-publish/Demos.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2019-03-08 Fri 15:30 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>&lrm;</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Gustavo Petri" />
</head>
<body>
<div id="content">
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org5c46527">1. JMM</a>
<ul>
<li><a href="#org1b840ec">1.1. Two threads in Java sharing memory</a></li>
<li><a href="#org02941a4">1.2. TSO.java</a></li>
</ul>
</li>
<li><a href="#orgc7fe3cb">2. Erlang</a>
<ul>
<li><a href="#org576d2eb">2.1. Simple Ping Pong applicatoin</a></li>
<li><a href="#org20a27c8">2.2. message-passing.erl</a></li>
<li><a href="#orgc8b6f7b">2.3. Start pong server</a></li>
<li><a href="#org01b8ca4">2.4. Start ping server</a></li>
</ul>
</li>
<li><a href="#orgda37a57">3. Starting up</a>
<ul>
<li><a href="#org3091892">3.1. SBT set up</a>
<ul>
<li><a href="#org8147863">3.1.1. build.sbt</a></li>
<li><a href="#org80e1393">3.1.2. </a></li>
</ul>
</li>
<li><a href="#org695fc1f">3.2. Hello World</a>
<ul>
<li><a href="#orge203094">3.2.1. Creates an actor system</a></li>
<li><a href="#org98c9f2c">3.2.2. Prints the url</a></li>
<li><a href="#orge3fd721">3.2.3. AkkaActors.scala</a></li>
<li><a href="#org05cacdb">3.2.4. </a></li>
</ul>
</li>
<li><a href="#org7d28a1c">3.3. Actor Local State and Behavior</a>
<ul>
<li><a href="#org0248db6">3.3.1. Creates a simple actor that keeps a counter</a></li>
<li><a href="#orgd0397e4">3.3.2. Increments the counter on a message receive</a></li>
<li><a href="#org4a5bcc1">3.3.3. BehaviorAndState.scala</a></li>
<li><a href="#orgc0acd02">3.3.4. </a></li>
<li><a href="#org4b5089e">3.3.5. Different messages</a></li>
</ul>
</li>
<li><a href="#orgdbd9233">3.4. Waiting for a response</a>
<ul>
<li><a href="#org0fc2e8f">3.4.1. A simple actor that receives a number, calculates Fibonacci and returns the value to the sender</a></li>
<li><a href="#org37d36d2">3.4.2. FiboActor.scala</a></li>
<li><a href="#orgd56145d">3.4.3. </a></li>
</ul>
</li>
<li><a href="#org8085a46">3.5. Communicating two actors</a>
<ul>
<li><a href="#org8e74c7a">3.5.1. Extension of the example above, where a query actor makes the query and prints out the response</a></li>
<li><a href="#org24137e6">3.5.2. Communication.scala</a></li>
<li><a href="#orgd32e7e1">3.5.3. </a></li>
</ul>
</li>
<li><a href="#orge240189">3.6. Become/Unbecome</a>
<ul>
<li><a href="#orgb3d03a4">3.6.1. Allows an actor to change it's behavior according to its state</a></li>
<li><a href="#org21791fc">3.6.2. BecomeUnbecome.scala</a></li>
<li><a href="#org441b96b">3.6.3. </a></li>
</ul>
</li>
<li><a href="#org7b126fa">3.7. Stop an actor</a>
<ul>
<li><a href="#orgc257700">3.7.1. Two ways to terminate an actor:</a></li>
<li><a href="#orgfba2ba2">3.7.2. </a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#org5b6af86">4. Fault Tolerance</a>
<ul>
<li><a href="#orge601923">4.1. Supervision and Monitoring</a>
<ul>
<li><a href="#orgafabf8d">4.1.1. Parent Child creation</a></li>
<li><a href="#org28d1fd0">4.1.2. Actor Life Cycle</a></li>
<li><a href="#orgce51cf4">4.1.3. Collecting answers</a></li>
</ul>
</li>
<li><a href="#orgd4d3489">4.2. Let it Crash!</a>
<ul>
<li><a href="#orgfc96fc4">4.2.1. OneForOneStrategy</a></li>
<li><a href="#orgb097eed">4.2.2. AllForOneStrategy</a></li>
<li><a href="#orge1e11b3">4.2.3. DeathWatch</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#org0e1cb22">5. Futures</a>
<ul>
<li><a href="#orgf34a0c8">5.1. A simple future</a>
<ul>
<li><a href="#org48f92df">5.1.1. Futures are supported by an Execution Context, which is a pool of threads</a></li>
<li><a href="#org51d5f1c">5.1.2. AddFuture.scala</a></li>
</ul>
</li>
<li><a href="#org0f47970">5.2. Send a message to an actor and wait with a future</a>
<ul>
<li><a href="#orgc176d7f">5.2.1. FutureWithActor.scala</a></li>
</ul>
</li>
<li><a href="#orgdb77a5b">5.3. FutureInsideActor.scala</a></li>
<li><a href="#org5029c12">5.4. Callback</a>
<ul>
<li><a href="#orgb5d80e6">5.4.1. Callback.scala</a></li>
</ul>
</li>
<li><a href="#org84b96df">5.5. For comprehensions</a>
<ul>
<li><a href="#orgf4b0c40">5.5.1. Parallel.scala</a></li>
</ul>
</li>
<li><a href="#orgc3a142e">5.6. Agents are deprecated</a></li>
</ul>
</li>
<li><a href="#org4550990">6. Persistence</a>
<ul>
<li><a href="#org45ec424">6.1. reference.conf</a></li>
<li><a href="#orged599d5">6.2. SamplePersistenceModel.scala</a></li>
<li><a href="#org243473f">6.3. SamplePersistenceActor.scala</a></li>
<li><a href="#orgf4e786d">6.4. SamplePersistenceApp.scala</a></li>
<li><a href="#orgde8dbf4">6.5. </a></li>
</ul>
</li>
<li><a href="#org8e2655c">7. Remote Actors and Scaling Applications</a>
<ul>
<li><a href="#orgb5e1f61">7.1. Configuration files</a>
<ul>
<li><a href="#org36b568f">7.1.1. application.conf</a></li>
</ul>
</li>
<li><a href="#org041325a">7.2. Remote actors on a different "Machine"</a>
<ul>
<li><a href="#org58e3a60">7.2.1. application-1.conf</a></li>
<li><a href="#orgd8ae42b">7.2.2. application-2.conf</a></li>
<li><a href="#orgcc6e21b">7.2.3. RemotingApplication.scala</a></li>
<li><a href="#org3c80081">7.2.4. </a></li>
</ul>
</li>
<li><a href="#org64dfa13">7.3. Looking up remote actors</a>
<ul>
<li><a href="#orgf61a651">7.3.1. The first call creates an actor system, and a SimpleActor in it</a></li>
<li><a href="#org8138033">7.3.2. The second call contacts the first node, and retrieves an actor reference in the first node</a></li>
<li><a href="#org4519689">7.3.3. LookingUpRemoteApplication.scala</a></li>
<li><a href="#org875a7d9">7.3.4. </a></li>
</ul>
</li>
<li><a href="#org5ab53bd">7.4. Deploy remote actors</a>
<ul>
<li><a href="#orgf3d1127">7.4.1. First call creates an actor system</a></li>
<li><a href="#org2336186">7.4.2. Second call create an actor on the first actor system</a></li>
<li><a href="#org5043a68">7.4.3. </a></li>
</ul>
</li>
<li><a href="#org70b56df">7.5. Scaling out an application</a>
<ul>
<li><a href="#org7d39e12">7.5.1. WorkerActor.scala</a></li>
<li><a href="#orgf4d7357">7.5.2. ScalingOutApplication.scala</a></li>
<li><a href="#org28c45dd">7.5.3. </a></li>
</ul>
</li>
<li><a href="#org56906a5">7.6. Chat application</a>
<ul>
<li><a href="#org2812ef3">7.6.1. A server hold all the clients and takes care of broadcasting messages</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#orge51c860">8. Clustering and Sharding</a>
<ul>
<li><a href="#org26e7823">8.1. Configuration</a>
<ul>
<li><a href="#org782e5bb">8.1.1. application-cluster-generic.conf</a></li>
</ul>
</li>
<li><a href="#org2eb5b7a">8.2. Distributed Pub/Sub</a>
<ul>
<li><a href="#org82db661">8.2.1. application-cluster-1.conf</a></li>
<li><a href="#org0935ffb">8.2.2. application-cluster-2.conf</a></li>
<li><a href="#org547a188">8.2.3. NotificationPublisher.scala</a></li>
<li><a href="#org3d26048">8.2.4. NotificationSubscriber.scala</a></li>
<li><a href="#orgd0fa400">8.2.5. DistributedPubSubApplication.scala</a></li>
<li><a href="#orgb7ff416">8.2.6. </a></li>
</ul>
</li>
<li><a href="#org32eb057">8.3. Sharding</a>
<ul>
<li><a href="#org43ceb87">8.3.1. application-cluster-shrading-1.conf</a></li>
<li><a href="#org0e170b0">8.3.2. application-cluster-shrading-2.conf</a></li>
<li><a href="#org4ee27e7">8.3.3. TemperatureActor.scala</a></li>
<li><a href="#org509b47a">8.3.4. ClusterShardingApplication.scala</a></li>
<li><a href="#org2617274">8.3.5. </a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#org4b7194a">9. Akka Patterns</a>
<ul>
<li><a href="#org806c115">9.1. Master/Slave</a>
<ul>
<li><a href="#org1a220b5">9.1.1. MasterWorkPulling.scala</a></li>
<li><a href="#org8986a6b">9.1.2. WorkerWorkPulling.scala</a></li>
<li><a href="#org2d04de4">9.1.3. GeneratorWorkPulling.scala</a></li>
<li><a href="#org9de3663">9.1.4. WorkerPullingApp.scala</a></li>
<li><a href="#org6bda152">9.1.5. </a></li>
</ul>
</li>
<li><a href="#org3f577ef">9.2. Ordered Termination</a>
<ul>
<li><a href="#orgd1fa6b3">9.2.1. ServiceHandler.scala</a></li>
<li><a href="#org6e70c38">9.2.2. ServiceManager.scala</a></li>
<li><a href="#orge4e2680">9.2.3. OrderedKiller.scala</a></li>
<li><a href="#org8746981">9.2.4. OrderedTerminationApp.scala</a></li>
<li><a href="#org9fdbe80">9.2.5. </a></li>
</ul>
</li>
<li><a href="#org0c83c8f">9.3. Shutdown</a>
<ul>
<li><a href="#org1fc9532">9.3.1. Reaper.scala</a></li>
<li><a href="#org28da48c">9.3.2. ReaperAwareActor.scala</a></li>
<li><a href="#orgd4ad6a0">9.3.3. ShutdownPatternWorker.scala</a></li>
<li><a href="#org54e34b1">9.3.4. ShutdownPatternMaster.scala</a></li>
<li><a href="#orgf4a999b">9.3.5. ShutdownPatternApp.scala</a></li>
<li><a href="#orgc8c2a86">9.3.6. </a></li>
</ul>
</li>
<li><a href="#orgcf4b94b">9.4. LoadBalancing</a>
<ul>
<li><a href="#org0e6866d">9.4.1. BalancedWorker.scala</a></li>
<li><a href="#org8f4cf6e">9.4.2. BalancingWorkApp.scala</a></li>
<li><a href="#org3e2ca3f">9.4.3. </a></li>
</ul>
</li>
<li><a href="#org9205ab3">9.5. Finite State Machine</a>
<ul>
<li><a href="#orge136f91">9.5.1. FSMChangeSubscriber.scala</a></li>
<li><a href="#org3c7a1c6">9.5.2. TrafficLightFSM.scala</a></li>
<li><a href="#org14f39b2">9.5.3. FSMApp.scala</a></li>
<li><a href="#orga45c64c">9.5.4. </a></li>
</ul>
</li>
<li><a href="#org9edae37">9.6. Enveloping</a>
<ul>
<li><a href="#org0faa228">9.6.1. EnvelopeReceive.scala</a></li>
<li><a href="#orgadc5ecf">9.6.2. EnvelopingActor.scala</a></li>
<li><a href="#orga87aeb1">9.6.3. EnvelopingActorApp.scala</a></li>
<li><a href="#orga414462">9.6.4. </a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#org872367d">10. Akka in a Docker Image</a>
<ul>
<li><a href="#org5f8eb77">10.1. Create a standalone application (.jar)</a></li>
<li><a href="#org5502ca1">10.2. Create a Docker image</a>
<ul>
<li><a href="#org5ab9641">10.2.1. copy the jar to a different directory</a></li>
<li><a href="#orgf899f78">10.2.2. Create a Dockerfile</a></li>
<li><a href="#org07db542">10.2.3. Create a Docker image</a></li>
<li><a href="#org9608cac">10.2.4. Run a container with the image</a></li>
<li><a href="#org7865be6">10.2.5. Stop/Remove the container and remove the image</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#org0961dc0">11. Launch EC2 instances</a>
<ul>
<li><a href="#org532c743">11.1. Start an AWS instance</a></li>
</ul>
</li>
<li><a href="#orge2d4fa6">12. Akka on EC2</a>
<ul>
<li><a href="#org188d9dc">12.1. AkkaConfig.scala</a></li>
<li><a href="#orgb17de65">12.2. EC2.scala</a></li>
<li><a href="#orgede18c3">12.3. BroadcastActor.scala</a></li>
<li><a href="#orge485cba">12.4. Main.scala</a></li>
<li><a href="#org2f66691">12.5. Compile</a></li>
<li><a href="#org96e989b">12.6. Run Locally</a></li>
<li><a href="#org83791bf">12.7. Run in an EC2 Autoscaling Group</a>
<ul>
<li><a href="#orgb2973c1">12.7.1. Go to EC2 Autoscaling Gropus (EC2 Management Console)</a></li>
<li><a href="#org0965399">12.7.2. Increment the desired/min/max instance count</a></li>
<li><a href="#org6b3da02">12.7.3. Navitage to Running Instances (EC2 Management Console)</a></li>
<li><a href="#orge52dd6e">12.7.4. Get public IP addresses of running instances and install java</a></li>
<li><a href="#orgca1fdcb">12.7.5. Copy the .jar file to each of the instances</a></li>
<li><a href="#org4b52f1e">12.7.6. Launch the application in each of the instances</a></li>
<li><a href="#org003b739">12.7.7. Add a new node and repeat</a></li>
<li><a href="#orgd74ffbc">12.7.8. Shutdown the scaling group</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#org636f4df">13. Akka on Docker</a>
<ul>
<li><a href="#org6155e2e">13.1. Explore the application:</a>
<ul>
<li><a href="#org3e0e1b2">13.1.1. Main.scala</a></li>
<li><a href="#org3b8cc0e">13.1.2. Create the docker image</a></li>
<li><a href="#org6ff1ffe">13.1.3. List image names and pick the right image</a></li>
<li><a href="#org8ca26f9">13.1.4. Start a first seed node and get the seed node ip</a></li>
<li><a href="#org29bd137">13.1.5. Start a second seed node using the address of the first one as a seed</a></li>
<li><a href="#orgb3b2d28">13.1.6. Start as many worker nodes as necessary</a></li>
<li><a href="#orgdc497e0">13.1.7. Remove all the nodes</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#org2470718">14. Akka on Kubernetes</a>
<ul>
<li><a href="#org07e6492">14.1. Main.scala</a></li>
<li><a href="#org1bf4556">14.2. k8s</a>
<ul>
<li><a href="#orgbe192b9">14.2.1. simple-akka-cluster-deployment.yml</a></li>
<li><a href="#org5288118">14.2.2. simple-akka-cluster-rbac.yml</a></li>
<li><a href="#org7c9598b">14.2.3. simple-akka-cluster-service.yml</a></li>
</ul>
</li>
<li><a href="#orga7874f9">14.3. Running the application on Minikube</a>
<ul>
<li><a href="#org320df90">14.3.1. Start the minikube (Simulates a kuberenetes equipped cluster) and link to its docker engine</a></li>
<li><a href="#org5b2d8b8">14.3.2. Publish the docker images to the minikube</a></li>
<li><a href="#org3ca7b5c">14.3.3. Create a service account and role in kuberenetes</a></li>
<li><a href="#org93f412f">14.3.4. Create a deployment</a></li>
<li><a href="#org150918d">14.3.5. Create a service</a></li>
<li><a href="#org41c10da">14.3.6. Open minikube's dashboard</a></li>
<li><a href="#orgdc479a4">14.3.7. Get the port of the akka http management API</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#orgae2132e">15. Replicated Data</a>
<ul>
<li><a href="#org3eda70b">15.1. CRDTs</a>
<ul>
<li><a href="#org1953878">15.1.1. SubscriptionManager.scala</a></li>
<li><a href="#org30ec815">15.1.2. DistributedDataApplication.scala</a></li>
<li><a href="#org2838b56">15.1.3. </a></li>
</ul>
</li>
</ul>
</li>
</ul>
</div>
</div>
<div id="outline-container-org5c46527" class="outline-2">
<h2 id="org5c46527"><span class="section-number-2">1</span> JMM</h2>
<div class="outline-text-2" id="text-1">
</div>
<div id="outline-container-org1b840ec" class="outline-3">
<h3 id="org1b840ec"><span class="section-number-3">1.1</span> Two threads in Java sharing memory</h3>
</div>
<div id="outline-container-org02941a4" class="outline-3">
<h3 id="org02941a4"><span class="section-number-3">1.2</span> <a href="weak-memory/TSO.java">TSO.java</a></h3>
<div class="outline-text-3" id="text-1-2">
<div class="org-src-container">
<pre class="src src-bash">java -ea -server TSO</pre>
</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-orgc7fe3cb" class="outline-2">
<h2 id="orgc7fe3cb"><span class="section-number-2">2</span> Erlang</h2>
<div class="outline-text-2" id="text-2">
</div>
<div id="outline-container-org576d2eb" class="outline-3">
<h3 id="org576d2eb"><span class="section-number-3">2.1</span> Simple Ping Pong applicatoin</h3>
</div>
<div id="outline-container-org20a27c8" class="outline-3">
<h3 id="org20a27c8"><span class="section-number-3">2.2</span> <a href="erlang/mp.erl">message-passing.erl</a></h3>
</div>
<div id="outline-container-orgc8b6f7b" class="outline-3">
<h3 id="orgc8b6f7b"><span class="section-number-3">2.3</span> Start pong server</h3>
<div class="outline-text-3" id="text-2-3">
<div class="org-src-container">
<pre class="src src-bash">erl -sname pong
mp: start_pong<span style="color: #ff8c00; font-size: 9.959999999999999pt;">()</span>.</pre>
</pre>
</div>
</div>
</div>
