DNA-2019/CloudC-publish/Demos.org
** Start ping server
#+BEGIN_SRC bash
erl -sname ping
mp: start_ping('pong@FVFX91RXHV2J').
#+END_SRC
* Starting up
** SBT set up
*** [[file:playground/akka-cookbook/build.sbt][build.sbt]]
*** 
#+BEGIN_SRC bash
sbt update
#+END_SRC
** Hello World
*** Creates an actor system
*** Prints the url
*** [[file:playground/akka-cookbook/src/main/scala/AkkaActors.scala][AkkaActors.scala]]
*** 
#+BEGIN_SRC bash
sbt "runMain io.github.gpetri.ch1.AkkaActorSystem"
#+END_SRC
** Actor Local State and Behavior
*** Creates a simple actor that keeps a counter
*** Increments the counter on a message receive
*** [[file:playground/akka-cookbook/src/main/scala/BehaviorAndState.scala][BehaviorAndState.scala]]
*** 
#+BEGIN_SRC bash
sbt "runMain io.github.gpetri.ch1.BehaviorAndState"
#+END_SRC
*** Different messages
** Waiting for a response
*** A simple actor that receives a number, calculates Fibonacci and returns the value to the sender
*** [[file:playground/akka-cookbook/src/main/scala/FiboActor.scala][FiboActor.scala]]
*** 
#+BEGIN_SRC bash
sbt "runMain io.github.gpetri.ch1.FiboActorApp"
#+END_SRC
** Communicating two actors
*** Extension of the example above, where a query actor makes the query and prints out the response
*** [[file:playground/akka-cookbook/src/main/scala/Communication.scala][Communication.scala]]
*** 
#+BEGIN_SRC bash
sbt "runMain io.github.gpetri.ch1.Communication"
#+END_SRC
** Become/Unbecome
*** Allows an actor to change it's behavior according to its state
*** [[file:playground/akka-cookbook/src/main/scala/BecomeUnbecome.scala][BecomeUnbecome.scala]]
*** 
#+BEGIN_SRC bash
sbt "runMain io.github.gpetri.ch1.BecomeUnbecomeApp"
#+END_SRC
** Stop an actor
*** Two ways to terminate an actor: 
**** Sending it a Poisonpill (sender chooses to terminate)
**** context.stop(self) Actor decides to shutdown after a message
*** 
#+BEGIN_SRC bash
sbt "runMain io.github.gpetri.ch1.ShutdownActorApp"
#+END_SRC

* Fault Tolerance
** Supervision and Monitoring
*** Parent Child creation
**** The actor that creates an actor is its parent
**** This can be seen no the path of the actor
**** [[file:playground/akka-cookbook/src/main/scala/ParentChild.scala][ParentChild.scala]]
**** 
#+BEGIN_SRC bash
sbt "runMain io.github.gpetri.ch2.ParentChildApp"
#+END_SRC
*** Actor Life Cycle
**** Stages of Actors:
- PreStart
- Start
- Stop
- PostRestart
**** [[file:playground/akka-cookbook/src/main/scala/ActorLifeCycle.scala][ActorLifeCycle.scala]]
**** 
#+BEGIN_SRC bash
sbt "runMain io.github.gpetri.ch2.ActorLifeCycleApp"
#+END_SRC
*** Collecting answers
**** We create an actor that will spawn children
**** It will send messages to all of themn, and then will print their answers
**** [[file:playground/akka-cookbook/src/main/scala/SendMessagesToChildren.scala][SendMessagesToChildren.scala]]
**** 
#+BEGIN_SRC bash
sbt "runMain io.github.gpetri.ch2.SendMessagesToChildrenApp"
#+END_SRC
** Let it Crash!
*** OneForOneStrategy
**** If an actor fails, only that actor is restarted, resumed or escalated
**** [[file:playground/akka-cookbook/src/main/scala/SupervisionStrategy.scala][SupervisionStrategy.scala]]
**** 
#+BEGIN_SRC bash
sbt "runMain io.github.gpetri.ch2.SupervisionStrategyApp"
#+END_SRC
*** AllForOneStrategy
**** The same is applied to all supervised actors if any one fails
**** [[file:playground/akka-cookbook/src/main/scala/AllForOneStrategy.scala][AllForOneStrategy.scala]]
