DNA-2019/CloudC-publish/Demos.html
<div id="outline-container-org01b8ca4" class="outline-3">
<h3 id="org01b8ca4"><span class="section-number-3">2.4</span> Start ping server</h3>
<div class="outline-text-3" id="text-2-4">
<div class="org-src-container">
<pre class="src src-bash">erl -sname ping
mp: start_ping<span style="color: #ff8c00; font-size: 9.959999999999999pt;">(</span><span style="color: #EEDC82; font-size: 9.959999999999999pt;">'pong@FVFX91RXHV2J'</span><span style="color: #ff8c00; font-size: 9.959999999999999pt;">)</span>.</pre>
</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-orgda37a57" class="outline-2">
<h2 id="orgda37a57"><span class="section-number-2">3</span> Starting up</h2>
<div class="outline-text-2" id="text-3">
</div>
<div id="outline-container-org3091892" class="outline-3">
<h3 id="org3091892"><span class="section-number-3">3.1</span> SBT set up</h3>
<div class="outline-text-3" id="text-3-1">
</div>
<div id="outline-container-org8147863" class="outline-4">
<h4 id="org8147863"><span class="section-number-4">3.1.1</span> <a href="playground/akka-cookbook/build.sbt">build.sbt</a></h4>
</div>
<div id="outline-container-org80e1393" class="outline-4">
<h4 id="org80e1393"><span class="section-number-4">3.1.2</span> </h4>
<div class="outline-text-4" id="text-3-1-2">
<div class="org-src-container">
<pre class="src src-bash">sbt update</pre>
</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-org695fc1f" class="outline-3">
<h3 id="org695fc1f"><span class="section-number-3">3.2</span> Hello World</h3>
<div class="outline-text-3" id="text-3-2">
</div>
<div id="outline-container-orge203094" class="outline-4">
<h4 id="orge203094"><span class="section-number-4">3.2.1</span> Creates an actor system</h4>
</div>
<div id="outline-container-org98c9f2c" class="outline-4">
<h4 id="org98c9f2c"><span class="section-number-4">3.2.2</span> Prints the url</h4>
</div>
<div id="outline-container-orge3fd721" class="outline-4">
<h4 id="orge3fd721"><span class="section-number-4">3.2.3</span> <a href="playground/akka-cookbook/src/main/scala/AkkaActors.scala">AkkaActors.scala</a></h4>
</div>
<div id="outline-container-org05cacdb" class="outline-4">
<h4 id="org05cacdb"><span class="section-number-4">3.2.4</span> </h4>
<div class="outline-text-4" id="text-3-2-4">
<div class="org-src-container">
<pre class="src src-bash">sbt <span style="color: #EEDC82; font-size: 9.959999999999999pt;">"runMain io.github.gpetri.ch1.AkkaActorSystem"</span></pre>
</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-org7d28a1c" class="outline-3">
<h3 id="org7d28a1c"><span class="section-number-3">3.3</span> Actor Local State and Behavior</h3>
<div class="outline-text-3" id="text-3-3">
</div>
<div id="outline-container-org0248db6" class="outline-4">
<h4 id="org0248db6"><span class="section-number-4">3.3.1</span> Creates a simple actor that keeps a counter</h4>
</div>
<div id="outline-container-orgd0397e4" class="outline-4">
<h4 id="orgd0397e4"><span class="section-number-4">3.3.2</span> Increments the counter on a message receive</h4>
</div>
<div id="outline-container-org4a5bcc1" class="outline-4">
<h4 id="org4a5bcc1"><span class="section-number-4">3.3.3</span> <a href="playground/akka-cookbook/src/main/scala/BehaviorAndState.scala">BehaviorAndState.scala</a></h4>
</div>
<div id="outline-container-orgc0acd02" class="outline-4">
<h4 id="orgc0acd02"><span class="section-number-4">3.3.4</span> </h4>
<div class="outline-text-4" id="text-3-3-4">
<div class="org-src-container">
<pre class="src src-bash">sbt <span style="color: #EEDC82; font-size: 9.959999999999999pt;">"runMain io.github.gpetri.ch1.BehaviorAndState"</span></pre>
</pre>
</div>
</div>
</div>
<div id="outline-container-org4b5089e" class="outline-4">
<h4 id="org4b5089e"><span class="section-number-4">3.3.5</span> Different messages</h4>
</div>
</div>
<div id="outline-container-orgdbd9233" class="outline-3">
<h3 id="orgdbd9233"><span class="section-number-3">3.4</span> Waiting for a response</h3>
<div class="outline-text-3" id="text-3-4">
</div>
<div id="outline-container-org0fc2e8f" class="outline-4">
<h4 id="org0fc2e8f"><span class="section-number-4">3.4.1</span> A simple actor that receives a number, calculates Fibonacci and returns the value to the sender</h4>
</div>
<div id="outline-container-org37d36d2" class="outline-4">
<h4 id="org37d36d2"><span class="section-number-4">3.4.2</span> <a href="playground/akka-cookbook/src/main/scala/FiboActor.scala">FiboActor.scala</a></h4>
</div>
<div id="outline-container-orgd56145d" class="outline-4">
<h4 id="orgd56145d"><span class="section-number-4">3.4.3</span> </h4>
<div class="outline-text-4" id="text-3-4-3">
<div class="org-src-container">
<pre class="src src-bash">sbt <span style="color: #EEDC82; font-size: 9.959999999999999pt;">"runMain io.github.gpetri.ch1.FiboActorApp"</span></pre>
</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-org8085a46" class="outline-3">
<h3 id="org8085a46"><span class="section-number-3">3.5</span> Communicating two actors</h3>
<div class="outline-text-3" id="text-3-5">
</div>
<div id="outline-container-org8e74c7a" class="outline-4">
<h4 id="org8e74c7a"><span class="section-number-4">3.5.1</span> Extension of the example above, where a query actor makes the query and prints out the response</h4>
</div>
<div id="outline-container-org24137e6" class="outline-4">
<h4 id="org24137e6"><span class="section-number-4">3.5.2</span> <a href="playground/akka-cookbook/src/main/scala/Communication.scala">Communication.scala</a></h4>
</div>
<div id="outline-container-orgd32e7e1" class="outline-4">
<h4 id="orgd32e7e1"><span class="section-number-4">3.5.3</span> </h4>
<div class="outline-text-4" id="text-3-5-3">
<div class="org-src-container">
<pre class="src src-bash">sbt <span style="color: #EEDC82; font-size: 9.959999999999999pt;">"runMain io.github.gpetri.ch1.Communication"</span></pre>
</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-orge240189" class="outline-3">
<h3 id="orge240189"><span class="section-number-3">3.6</span> Become/Unbecome</h3>
<div class="outline-text-3" id="text-3-6">
</div>
<div id="outline-container-orgb3d03a4" class="outline-4">
<h4 id="orgb3d03a4"><span class="section-number-4">3.6.1</span> Allows an actor to change it's behavior according to its state</h4>
</div>
<div id="outline-container-org21791fc" class="outline-4">
<h4 id="org21791fc"><span class="section-number-4">3.6.2</span> <a href="playground/akka-cookbook/src/main/scala/BecomeUnbecome.scala">BecomeUnbecome.scala</a></h4>
</div>
<div id="outline-container-org441b96b" class="outline-4">
<h4 id="org441b96b"><span class="section-number-4">3.6.3</span> </h4>
<div class="outline-text-4" id="text-3-6-3">
<div class="org-src-container">
<pre class="src src-bash">sbt <span style="color: #EEDC82; font-size: 9.959999999999999pt;">"runMain io.github.gpetri.ch1.BecomeUnbecomeApp"</span></pre>
</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-org7b126fa" class="outline-3">
<h3 id="org7b126fa"><span class="section-number-3">3.7</span> Stop an actor</h3>
<div class="outline-text-3" id="text-3-7">
</div>
<div id="outline-container-orgc257700" class="outline-4">
<h4 id="orgc257700"><span class="section-number-4">3.7.1</span> Two ways to terminate an actor:</h4>
<div class="outline-text-4" id="text-3-7-1">
</div>
<ol class="org-ol">
<li><a id="orgb9b8009"></a>Sending it a Poisonpill (sender chooses to terminate)<br /></li>
<li><a id="orgde666b5"></a>context.stop(self) Actor decides to shutdown after a message<br /></li>
</ol>
</div>
<div id="outline-container-orgfba2ba2" class="outline-4">
<h4 id="orgfba2ba2"><span class="section-number-4">3.7.2</span> </h4>
<div class="outline-text-4" id="text-3-7-2">
<div class="org-src-container">
<pre class="src src-bash">sbt <span style="color: #EEDC82; font-size: 9.959999999999999pt;">"runMain io.github.gpetri.ch1.ShutdownActorApp"</span></pre>
</pre>
</div>
</div>
</div>
</div>
</div>

<div id="outline-container-org5b6af86" class="outline-2">
<h2 id="org5b6af86"><span class="section-number-2">4</span> Fault Tolerance</h2>
<div class="outline-text-2" id="text-4">
</div>
<div id="outline-container-orge601923" class="outline-3">
<h3 id="orge601923"><span class="section-number-3">4.1</span> Supervision and Monitoring</h3>
<div class="outline-text-3" id="text-4-1">
</div>
<div id="outline-container-orgafabf8d" class="outline-4">
<h4 id="orgafabf8d"><span class="section-number-4">4.1.1</span> Parent Child creation</h4>
<div class="outline-text-4" id="text-4-1-1">
</div>
<ol class="org-ol">
<li><a id="org6744174"></a>The actor that creates an actor is its parent<br /></li>
<li><a id="org7606227"></a>This can be seen no the path of the actor<br /></li>
<li><a id="org02be6c4"></a><a href="playground/akka-cookbook/src/main/scala/ParentChild.scala">ParentChild.scala</a><br /></li>
<li><a id="org6759aa1"></a><br />
<div class="outline-text-5" id="text-4-1-1-4">
<div class="org-src-container">
<pre class="src src-bash">sbt <span style="color: #EEDC82; font-size: 9.959999999999999pt;">"runMain io.github.gpetri.ch2.ParentChildApp"</span></pre>
</pre>
</div>
</div>
</li>
</ol>
</div>
<div id="outline-container-org28d1fd0" class="outline-4">
<h4 id="org28d1fd0"><span class="section-number-4">4.1.2</span> Actor Life Cycle</h4>
<div class="outline-text-4" id="text-4-1-2">
</div>
<ol class="org-ol">
<li><a id="org3357293"></a>Stages of Actors:<br />
<div class="outline-text-5" id="text-4-1-2-1">
<ul class="org-ul">
<li>PreStart</li>
<li>Start</li>
<li>Stop</li>
<li>PostRestart</li>
</ul>
</div>
</li>
<li><a id="orgd9b3cb4"></a><a href="playground/akka-cookbook/src/main/scala/ActorLifeCycle.scala">ActorLifeCycle.scala</a><br /></li>
<li><a id="orgec15ce7"></a><br />
<div class="outline-text-5" id="text-4-1-2-3">
<div class="org-src-container">
<pre class="src src-bash">sbt <span style="color: #EEDC82; font-size: 9.959999999999999pt;">"runMain io.github.gpetri.ch2.ActorLifeCycleApp"</span></pre>
</pre>
</div>
</div>
</li>
</ol>
</div>
<div id="outline-container-orgce51cf4" class="outline-4">
<h4 id="orgce51cf4"><span class="section-number-4">4.1.3</span> Collecting answers</h4>
<div class="outline-text-4" id="text-4-1-3">
</div>
<ol class="org-ol">
<li><a id="org79d7540"></a>We create an actor that will spawn children<br /></li>
<li><a id="org3d03ea1"></a>It will send messages to all of themn, and then will print their answers<br /></li>
<li><a id="orgcb241e2"></a><a href="playground/akka-cookbook/src/main/scala/SendMessagesToChildren.scala">SendMessagesToChildren.scala</a><br /></li>
<li><a id="orgcd5273a"></a><br />
<div class="outline-text-5" id="text-4-1-3-4">
<div class="org-src-container">
<pre class="src src-bash">sbt <span style="color: #EEDC82; font-size: 9.959999999999999pt;">"runMain io.github.gpetri.ch2.SendMessagesToChildrenApp"</span></pre>
</pre>
</div>
</div>
</li>
</ol>
</div>
</div>
<div id="outline-container-orgd4d3489" class="outline-3">
<h3 id="orgd4d3489"><span class="section-number-3">4.2</span> Let it Crash!</h3>
<div class="outline-text-3" id="text-4-2">
</div>
<div id="outline-container-orgfc96fc4" class="outline-4">
<h4 id="orgfc96fc4"><span class="section-number-4">4.2.1</span> OneForOneStrategy</h4>
<div class="outline-text-4" id="text-4-2-1">
</div>
<ol class="org-ol">
<li><a id="org29ba7f0"></a>If an actor fails, only that actor is restarted, resumed or escalated<br /></li>
<li><a id="orgc6ad583"></a><a href="playground/akka-cookbook/src/main/scala/SupervisionStrategy.scala">SupervisionStrategy.scala</a><br /></li>
<li><a id="org6b051f4"></a><br />
<div class="outline-text-5" id="text-4-2-1-3">
<div class="org-src-container">
<pre class="src src-bash">sbt <span style="color: #EEDC82; font-size: 9.959999999999999pt;">"runMain io.github.gpetri.ch2.SupervisionStrategyApp"</span></pre>
</pre>
</div>
</div>
</li>
</ol>
</div>
<div id="outline-container-orgb097eed" class="outline-4">
<h4 id="orgb097eed"><span class="section-number-4">4.2.2</span> AllForOneStrategy</h4>
<div class="outline-text-4" id="text-4-2-2">
</div>
<ol class="org-ol">
<li><a id="org6229d84"></a>The same is applied to all supervised actors if any one fails<br /></li>
<li><a id="org850a8a6"></a><a href="playground/akka-cookbook/src/main/scala/AllForOneStrategy.scala">AllForOneStrategy.scala</a><br /></li>
