DNA-2019/CloudC-publish/Demos.org
**** 
#+BEGIN_SRC bash
sbt "runMain io.github.gpetri.ch2.AllForOneStrategyApp"
#+END_SRC
*** DeathWatch
**** Monitoring an actor
**** [[file:playground/akka-cookbook/src/main/scala/DeathWatch.scala][DeathWatch.scala]]
**** 
#+BEGIN_SRC bash
sbt "runMain io.github.gpetri.ch2. DeathWatchApp"
#+END_SRC
* Futures
** A simple future
*** Futures are supported by an Execution Context, which is a pool of threads
*** [[file:playground/akka-cookbook/src/main/scala/AddFuture.scala][AddFuture.scala]]
** Send a message to an actor and wait with a future
*** [[file:playground/akka-cookbook/src/main/scala/FutureWithActor.scala][FutureWithActor.scala]]
** [[file:playground/akka-cookbook/src/main/scala/FutureInsideActor.scala][FutureInsideActor.scala]]
** Callback
*** [[file:playground/akka-cookbook/src/main/scala/Callback.scala][Callback.scala]]
** For comprehensions
*** [[file:playground/akka-cookbook/src/main/scala/Parallel.scala][Parallel.scala]]
** Agents are deprecated
* Persistence
** [[file:playground/akka-cookbook/src/main/resources/reference.conf][reference.conf]]
** [[file:playground/akka-cookbook/src/main/scala/io/github/gpetri/ch6/SamplePersistenceModel.scala][SamplePersistenceModel.scala]]
** [[file:playground/akka-cookbook/src/main/scala/io/github/gpetri/ch6/SamplePersistenceActor.scala][SamplePersistenceActor.scala]]
** [[file:playground/akka-cookbook/src/main/scala/io/github/gpetri/ch6/SamplePersistenceApp.scala][SamplePersistenceApp.scala]]
** 
#+BEGIN_SRC bash
sbt "runMain io.github.gpetri.ch6.SamplePersistenceApp"
#+END_SRC 
* Remote Actors and Scaling Applications
** Configuration files
*** [[file:playground/akka-cookbook/src/main/resources/application.conf][application.conf]]
** Remote actors on a different "Machine"
*** [[file:playground/akka-cookbook/src/main/resources/application-1.conf][application-1.conf]]
*** [[file:playground/akka-cookbook/src/main/resources/application-2.conf][application-2.conf]]
*** [[file:playground/akka-cookbook/src/main/scala/io/github/gpetri/ch7/RemotingApplication.scala][RemotingApplication.scala]]
*** 
#+BEGIN_SRC bash
sbt -Dconfig.resource=application-1.conf "runMain io.github.gpetri.ch7.HelloAkkaRemoting1"
sbt -Dconfig.resource=application-2.conf "runMain io.github.gpetri.ch7.HelloAkkaRemoting2" 
#+END_SRC 
** Looking up remote actors
*** The first call creates an actor system, and a SimpleActor in it
*** The second call contacts the first node, and retrieves an actor reference in the first node
*** [[file:playground/akka-cookbook/src/main/scala/io/github/gpetri/ch7/LookingUpRemoteApplication.scala][LookingUpRemoteApplication.scala]]
*** 
#+BEGIN_SRC bash
sbt -Dconfig.resource=application-2.conf "runMain io.github.gpetri.ch7.LookingUpRemoteActors" 
sbt -Dconfig.resource=application-1.conf "runMain io.github.gpetri.ch7.LookingUpActorSelection"
#+END_SRC 
** Deploy remote actors
*** First call creates an actor system
*** Second call create an actor on the first actor system
*** 
#+BEGIN_SRC bash
sbt -Dconfig.resource=application-1.conf "runMain io.github.gpetri.ch7.RemoteActorsProgrammatically1" 
sbt -Dconfig.resource=application-2.conf "runMain io.github.gpetri.ch7.RemoteActorsProgrammatically2"
#+END_SRC 
** Scaling out an application
*** [[file:playground/akka-cookbook/src/main/scala/io/github/gpetri/ch7/WorkerActor.scala][WorkerActor.scala]]
*** [[file:playground/akka-cookbook/src/main/scala/io/github/gpetri/ch7/ScalingOutApplication.scala][ScalingOutApplication.scala]]
*** 
#+BEGIN_SRC bash
sbt -Dconfig.resource=application-1.conf "runMain io.github.gpetri.ch7.ScalingOutMaster" 
sbt -Dconfig.resource=application-2.conf "runMain io.github.gpetri.ch7.ScalingOutWorker"
sbt -Dconfig.resource=application-3.conf "runMain io.github.gpetri.ch7.ScalingOutWorker"
#+END_SRC 
** Chat application
