DNA-2019/CloudC-publish/Demos.html
<li><a id="org8c546cb"></a><br />
<div class="outline-text-5" id="text-4-2-2-3">
<div class="org-src-container">
<pre class="src src-bash">sbt <span style="color: #EEDC82; font-size: 9.959999999999999pt;">"runMain io.github.gpetri.ch2.AllForOneStrategyApp"</span></pre>
</pre>
</div>
</div>
</li>
</ol>
</div>
<div id="outline-container-orge1e11b3" class="outline-4">
<h4 id="orge1e11b3"><span class="section-number-4">4.2.3</span> DeathWatch</h4>
<div class="outline-text-4" id="text-4-2-3">
</div>
<ol class="org-ol">
<li><a id="orgede2253"></a>Monitoring an actor<br /></li>
<li><a id="org7543f7d"></a><a href="playground/akka-cookbook/src/main/scala/DeathWatch.scala">DeathWatch.scala</a><br /></li>
<li><a id="org8bdc609"></a><br />
<div class="outline-text-5" id="text-4-2-3-3">
<div class="org-src-container">
<pre class="src src-bash">sbt <span style="color: #EEDC82; font-size: 9.959999999999999pt;">"runMain io.github.gpetri.ch2. DeathWatchApp"</span></pre>
</pre>
</div>
</div>
</li>
</ol>
</div>
</div>
</div>
<div id="outline-container-org0e1cb22" class="outline-2">
<h2 id="org0e1cb22"><span class="section-number-2">5</span> Futures</h2>
<div class="outline-text-2" id="text-5">
</div>
<div id="outline-container-orgf34a0c8" class="outline-3">
<h3 id="orgf34a0c8"><span class="section-number-3">5.1</span> A simple future</h3>
<div class="outline-text-3" id="text-5-1">
</div>
<div id="outline-container-org48f92df" class="outline-4">
<h4 id="org48f92df"><span class="section-number-4">5.1.1</span> Futures are supported by an Execution Context, which is a pool of threads</h4>
</div>
<div id="outline-container-org51d5f1c" class="outline-4">
<h4 id="org51d5f1c"><span class="section-number-4">5.1.2</span> <a href="playground/akka-cookbook/src/main/scala/AddFuture.scala">AddFuture.scala</a></h4>
</div>
</div>
<div id="outline-container-org0f47970" class="outline-3">
<h3 id="org0f47970"><span class="section-number-3">5.2</span> Send a message to an actor and wait with a future</h3>
<div class="outline-text-3" id="text-5-2">
</div>
<div id="outline-container-orgc176d7f" class="outline-4">
<h4 id="orgc176d7f"><span class="section-number-4">5.2.1</span> <a href="playground/akka-cookbook/src/main/scala/FutureWithActor.scala">FutureWithActor.scala</a></h4>
</div>
</div>
<div id="outline-container-orgdb77a5b" class="outline-3">
<h3 id="orgdb77a5b"><span class="section-number-3">5.3</span> <a href="playground/akka-cookbook/src/main/scala/FutureInsideActor.scala">FutureInsideActor.scala</a></h3>
</div>
<div id="outline-container-org5029c12" class="outline-3">
<h3 id="org5029c12"><span class="section-number-3">5.4</span> Callback</h3>
<div class="outline-text-3" id="text-5-4">
</div>
<div id="outline-container-orgb5d80e6" class="outline-4">
<h4 id="orgb5d80e6"><span class="section-number-4">5.4.1</span> <a href="playground/akka-cookbook/src/main/scala/Callback.scala">Callback.scala</a></h4>
</div>
</div>
<div id="outline-container-org84b96df" class="outline-3">
<h3 id="org84b96df"><span class="section-number-3">5.5</span> For comprehensions</h3>
<div class="outline-text-3" id="text-5-5">
</div>
<div id="outline-container-orgf4b0c40" class="outline-4">
<h4 id="orgf4b0c40"><span class="section-number-4">5.5.1</span> <a href="playground/akka-cookbook/src/main/scala/Parallel.scala">Parallel.scala</a></h4>
</div>
</div>
<div id="outline-container-orgc3a142e" class="outline-3">
<h3 id="orgc3a142e"><span class="section-number-3">5.6</span> Agents are deprecated</h3>
</div>
</div>
<div id="outline-container-org4550990" class="outline-2">
<h2 id="org4550990"><span class="section-number-2">6</span> Persistence</h2>
<div class="outline-text-2" id="text-6">
</div>
<div id="outline-container-org45ec424" class="outline-3">
<h3 id="org45ec424"><span class="section-number-3">6.1</span> <a href="playground/akka-cookbook/src/main/resources/reference.conf">reference.conf</a></h3>
</div>
<div id="outline-container-orged599d5" class="outline-3">
<h3 id="orged599d5"><span class="section-number-3">6.2</span> <a href="playground/akka-cookbook/src/main/scala/io/github/gpetri/ch6/SamplePersistenceModel.scala">SamplePersistenceModel.scala</a></h3>
</div>
<div id="outline-container-org243473f" class="outline-3">
<h3 id="org243473f"><span class="section-number-3">6.3</span> <a href="playground/akka-cookbook/src/main/scala/io/github/gpetri/ch6/SamplePersistenceActor.scala">SamplePersistenceActor.scala</a></h3>
</div>
<div id="outline-container-orgf4e786d" class="outline-3">
<h3 id="orgf4e786d"><span class="section-number-3">6.4</span> <a href="playground/akka-cookbook/src/main/scala/io/github/gpetri/ch6/SamplePersistenceApp.scala">SamplePersistenceApp.scala</a></h3>
</div>
<div id="outline-container-orgde8dbf4" class="outline-3">
<h3 id="orgde8dbf4"><span class="section-number-3">6.5</span> </h3>
<div class="outline-text-3" id="text-6-5">
<div class="org-src-container">
<pre class="src src-bash">sbt <span style="color: #EEDC82; font-size: 9.959999999999999pt;">"runMain io.github.gpetri.ch6.SamplePersistenceApp"</span></pre>
</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-org8e2655c" class="outline-2">
<h2 id="org8e2655c"><span class="section-number-2">7</span> Remote Actors and Scaling Applications</h2>
<div class="outline-text-2" id="text-7">
</div>
<div id="outline-container-orgb5e1f61" class="outline-3">
<h3 id="orgb5e1f61"><span class="section-number-3">7.1</span> Configuration files</h3>
<div class="outline-text-3" id="text-7-1">
</div>
<div id="outline-container-org36b568f" class="outline-4">
<h4 id="org36b568f"><span class="section-number-4">7.1.1</span> <a href="playground/akka-cookbook/src/main/resources/application.conf">application.conf</a></h4>
</div>
</div>
<div id="outline-container-org041325a" class="outline-3">
<h3 id="org041325a"><span class="section-number-3">7.2</span> Remote actors on a different "Machine"</h3>
<div class="outline-text-3" id="text-7-2">
</div>
<div id="outline-container-org58e3a60" class="outline-4">
<h4 id="org58e3a60"><span class="section-number-4">7.2.1</span> <a href="playground/akka-cookbook/src/main/resources/application-1.conf">application-1.conf</a></h4>
</div>
<div id="outline-container-orgd8ae42b" class="outline-4">
<h4 id="orgd8ae42b"><span class="section-number-4">7.2.2</span> <a href="playground/akka-cookbook/src/main/resources/application-2.conf">application-2.conf</a></h4>
</div>
<div id="outline-container-orgcc6e21b" class="outline-4">
<h4 id="orgcc6e21b"><span class="section-number-4">7.2.3</span> <a href="playground/akka-cookbook/src/main/scala/io/github/gpetri/ch7/RemotingApplication.scala">RemotingApplication.scala</a></h4>
</div>
<div id="outline-container-org3c80081" class="outline-4">
<h4 id="org3c80081"><span class="section-number-4">7.2.4</span> </h4>
<div class="outline-text-4" id="text-7-2-4">
<div class="org-src-container">
<pre class="src src-bash">sbt -Dconfig.resource=application-1.conf <span style="color: #EEDC82; font-size: 9.959999999999999pt;">"runMain io.github.gpetri.ch7.HelloAkkaRemoting1"</span>
sbt -Dconfig.resource=application-2.conf <span style="color: #EEDC82; font-size: 9.959999999999999pt;">"runMain io.github.gpetri.ch7.HelloAkkaRemoting2"</span> </pre>
</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-org64dfa13" class="outline-3">
<h3 id="org64dfa13"><span class="section-number-3">7.3</span> Looking up remote actors</h3>
<div class="outline-text-3" id="text-7-3">
</div>
<div id="outline-container-orgf61a651" class="outline-4">
<h4 id="orgf61a651"><span class="section-number-4">7.3.1</span> The first call creates an actor system, and a SimpleActor in it</h4>
</div>
<div id="outline-container-org8138033" class="outline-4">
<h4 id="org8138033"><span class="section-number-4">7.3.2</span> The second call contacts the first node, and retrieves an actor reference in the first node</h4>
</div>
<div id="outline-container-org4519689" class="outline-4">
<h4 id="org4519689"><span class="section-number-4">7.3.3</span> <a href="playground/akka-cookbook/src/main/scala/io/github/gpetri/ch7/LookingUpRemoteApplication.scala">LookingUpRemoteApplication.scala</a></h4>
</div>
<div id="outline-container-org875a7d9" class="outline-4">
<h4 id="org875a7d9"><span class="section-number-4">7.3.4</span> </h4>
<div class="outline-text-4" id="text-7-3-4">
<div class="org-src-container">
<pre class="src src-bash">sbt -Dconfig.resource=application-2.conf <span style="color: #EEDC82; font-size: 9.959999999999999pt;">"runMain io.github.gpetri.ch7.LookingUpRemoteActors"</span> 
sbt -Dconfig.resource=application-1.conf <span style="color: #EEDC82; font-size: 9.959999999999999pt;">"runMain io.github.gpetri.ch7.LookingUpActorSelection"</span></pre>
</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-org5ab53bd" class="outline-3">
<h3 id="org5ab53bd"><span class="section-number-3">7.4</span> Deploy remote actors</h3>
<div class="outline-text-3" id="text-7-4">
</div>
<div id="outline-container-orgf3d1127" class="outline-4">
<h4 id="orgf3d1127"><span class="section-number-4">7.4.1</span> First call creates an actor system</h4>
</div>
<div id="outline-container-org2336186" class="outline-4">
<h4 id="org2336186"><span class="section-number-4">7.4.2</span> Second call create an actor on the first actor system</h4>
</div>
<div id="outline-container-org5043a68" class="outline-4">
<h4 id="org5043a68"><span class="section-number-4">7.4.3</span> </h4>
<div class="outline-text-4" id="text-7-4-3">
<div class="org-src-container">
<pre class="src src-bash">sbt -Dconfig.resource=application-1.conf <span style="color: #EEDC82; font-size: 9.959999999999999pt;">"runMain io.github.gpetri.ch7.RemoteActorsProgrammatically1"</span> 
sbt -Dconfig.resource=application-2.conf <span style="color: #EEDC82; font-size: 9.959999999999999pt;">"runMain io.github.gpetri.ch7.RemoteActorsProgrammatically2"</span></pre>
</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-org70b56df" class="outline-3">
<h3 id="org70b56df"><span class="section-number-3">7.5</span> Scaling out an application</h3>
<div class="outline-text-3" id="text-7-5">
</div>
<div id="outline-container-org7d39e12" class="outline-4">
<h4 id="org7d39e12"><span class="section-number-4">7.5.1</span> <a href="playground/akka-cookbook/src/main/scala/io/github/gpetri/ch7/WorkerActor.scala">WorkerActor.scala</a></h4>
</div>
<div id="outline-container-orgf4d7357" class="outline-4">
<h4 id="orgf4d7357"><span class="section-number-4">7.5.2</span> <a href="playground/akka-cookbook/src/main/scala/io/github/gpetri/ch7/ScalingOutApplication.scala">ScalingOutApplication.scala</a></h4>
</div>
<div id="outline-container-org28c45dd" class="outline-4">
<h4 id="org28c45dd"><span class="section-number-4">7.5.3</span> </h4>
<div class="outline-text-4" id="text-7-5-3">
<div class="org-src-container">
<pre class="src src-bash">sbt -Dconfig.resource=application-1.conf <span style="color: #EEDC82; font-size: 9.959999999999999pt;">"runMain io.github.gpetri.ch7.ScalingOutMaster"</span> 
sbt -Dconfig.resource=application-2.conf <span style="color: #EEDC82; font-size: 9.959999999999999pt;">"runMain io.github.gpetri.ch7.ScalingOutWorker"</span>
sbt -Dconfig.resource=application-3.conf <span style="color: #EEDC82; font-size: 9.959999999999999pt;">"runMain io.github.gpetri.ch7.ScalingOutWorker"</span></pre>
</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-org56906a5" class="outline-3">
<h3 id="org56906a5"><span class="section-number-3">7.6</span> Chat application</h3>
<div class="outline-text-3" id="text-7-6">
</div>
