DNA-2019/CloudC-publish/Demos.org
*** A server hold all the clients and takes care of broadcasting messages
#+BEGIN_SRC bash
sbt -Dconfig.resource=application-1.conf "runMain io.github.gpetri.ch7.ChatServerApplication" 
sbt -Dconfig.resource=application-2.conf "runMain io.github.gpetri.ch7.ChatClientApplication"
sbt -Dconfig.resource=application-3.conf "runMain io.github.gpetri.ch7.ChatClientApplication"
#+END_SRC 
* Clustering and Sharding
** Configuration
*** [[file:playground/akka-cookbook/src/main/resources/application-cluster-generic.conf][application-cluster-generic.conf]]
** Distributed Pub/Sub
*** [[file:playground/akka-cookbook/src/main/resources/application-cluster-1.conf][application-cluster-1.conf]]
*** [[file:playground/akka-cookbook/src/main/resources/application-cluster-2.conf][application-cluster-2.conf]]
*** [[file:playground/akka-cookbook/src/main/scala/io/github/gpetri/ch7/NotificationPublisher.scala][NotificationPublisher.scala]]
*** [[file:playground/akka-cookbook/src/main/scala/io/github/gpetri/ch7/NotificationSubscriber.scala][NotificationSubscriber.scala]]
*** [[file:playground/akka-cookbook/src/main/scala/io/github/gpetri/ch7/DistributedPubSubApplication.scala][DistributedPubSubApplication.scala]]
*** 
#+BEGIN_SRC bash
sbt -Dconfig.resource=application-cluster-1.conf "runMain io.github.gpetri.ch7.DistributedPubSubApplication" 
sbt -Dconfig.resource=application-cluster-2.conf "runMain io.github.gpetri.ch7.DistributedPubSubApplication" 
#+END_SRC 
** Sharding
*** [[file:playground/akka-cookbook/src/main/resources/application-cluster-shrading-1.conf][application-cluster-shrading-1.conf]]
*** [[file:playground/akka-cookbook/src/main/resources/application-cluster-shrading-2.conf][application-cluster-shrading-2.conf]]
*** [[file:playground/akka-cookbook/src/main/scala/io/github/gpetri/ch7/TemperatureActor.scala][TemperatureActor.scala]]
*** [[file:playground/akka-cookbook/src/main/scala/io/github/gpetri/ch7/ClusterShardingApplication.scala][ClusterShardingApplication.scala]]
*** 
#+BEGIN_SRC bash
sbt -Dconfig.resource=application-cluster-sharding-1.conf "runMain io.github.gpetri.ch7.ClusterShardingApplication" 
sbt -Dconfig.resource=application-cluster-sharding-2.conf "runMain io.github.gpetri.ch7.ClusterShardingApplication" 
#+END_SRC 
* Akka Patterns
** Master/Slave
*** [[file:playground/akka-cookbook/src/main/scala/io/github/gpetri/ch10/MasterWorkPulling.scala][MasterWorkPulling.scala]]
*** [[file:playground/akka-cookbook/src/main/scala/io/github/gpetri/ch10/WorkerWorkPulling.scala][WorkerWorkPulling.scala]]
*** [[file:playground/akka-cookbook/src/main/scala/io/github/gpetri/ch10/GeneratorWorkPulling.scala][GeneratorWorkPulling.scala]]
*** [[file:playground/akka-cookbook/src/main/scala/io/github/gpetri/ch10/WorkPullingApp.scala][WorkerPullingApp.scala]]
*** 
#+BEGIN_SRC bash
sbt "runMain io.github.gpetri.ch10.WorkPullingApp"
#+END_SRC
** Ordered Termination
*** [[file:playground/akka-cookbook/src/main/scala/io/github/gpetri/ch10/ServiceHandler.scala][ServiceHandler.scala]]
*** [[file:playground/akka-cookbook/src/main/scala/io/github/gpetri/ch10/ServicesManager.scala][ServiceManager.scala]]
*** [[file:playground/akka-cookbook/src/main/scala/io/github/gpetri/ch10/OrderedKiller.scala][OrderedKiller.scala]]
*** [[file:playground/akka-cookbook/src/main/scala/io/github/gpetri/ch10/OrderedTerminationApp.scala][OrderedTerminationApp.scala]]
*** 
#+BEGIN_SRC bash
sbt "runMain io.github.gpetri.ch10.OrderedTerminationApp"
#+END_SRC
** Shutdown
*** [[file:playground/akka-cookbook/src/main/scala/io/github/gpetri/ch10/Reaper.scala][Reaper.scala]]
*** [[file:playground/akka-cookbook/src/main/scala/io/github/gpetri/ch10/ReaperAwareActor.scala][ReaperAwareActor.scala]]
*** [[file:playground/akka-cookbook/src/main/scala/io/github/gpetri/ch10/ShutdownPatternWorker.scala][ShutdownPatternWorker.scala]]
*** [[file:playground/akka-cookbook/src/main/scala/io/github/gpetri/ch10/ShutdownPatternMaster.scala][ShutdownPatternMaster.scala]]
*** [[file:playground/akka-cookbook/src/main/scala/io/github/gpetri/ch10/ShutdownPatternApp.scala][ShutdownPatternApp.scala]]
*** 
#+BEGIN_SRC bash
sbt "runMain io.github.gpetri.ch10.ShutdownPatternApp"
#+END_SRC
** LoadBalancing
*** [[file:playground/akka-cookbook/src/main/scala/io/github/gpetri/ch10/BalancedWorker.scala][BalancedWorker.scala]]
*** [[file:playground/akka-cookbook/src/main/scala/io/github/gpetri/ch10/BalancingWorkApp.scala][BalancingWorkApp.scala]]
