DNA-2019/CloudC-publish/Demos.html
<div id="outline-container-org2812ef3" class="outline-4">
<h4 id="org2812ef3"><span class="section-number-4">7.6.1</span> A server hold all the clients and takes care of broadcasting messages</h4>
<div class="outline-text-4" id="text-7-6-1">
<div class="org-src-container">
<pre class="src src-bash">sbt -Dconfig.resource=application-1.conf <span style="color: #EEDC82; font-size: 9.959999999999999pt;">"runMain io.github.gpetri.ch7.ChatServerApplication"</span> 
sbt -Dconfig.resource=application-2.conf <span style="color: #EEDC82; font-size: 9.959999999999999pt;">"runMain io.github.gpetri.ch7.ChatClientApplication"</span>
sbt -Dconfig.resource=application-3.conf <span style="color: #EEDC82; font-size: 9.959999999999999pt;">"runMain io.github.gpetri.ch7.ChatClientApplication"</span></pre>
</pre>
</div>
</div>
</div>
</div>
</div>
<div id="outline-container-orge51c860" class="outline-2">
<h2 id="orge51c860"><span class="section-number-2">8</span> Clustering and Sharding</h2>
<div class="outline-text-2" id="text-8">
</div>
<div id="outline-container-org26e7823" class="outline-3">
<h3 id="org26e7823"><span class="section-number-3">8.1</span> Configuration</h3>
<div class="outline-text-3" id="text-8-1">
</div>
<div id="outline-container-org782e5bb" class="outline-4">
<h4 id="org782e5bb"><span class="section-number-4">8.1.1</span> <a href="playground/akka-cookbook/src/main/resources/application-cluster-generic.conf">application-cluster-generic.conf</a></h4>
</div>
</div>
<div id="outline-container-org2eb5b7a" class="outline-3">
<h3 id="org2eb5b7a"><span class="section-number-3">8.2</span> Distributed Pub/Sub</h3>
<div class="outline-text-3" id="text-8-2">
</div>
<div id="outline-container-org82db661" class="outline-4">
<h4 id="org82db661"><span class="section-number-4">8.2.1</span> <a href="playground/akka-cookbook/src/main/resources/application-cluster-1.conf">application-cluster-1.conf</a></h4>
</div>
<div id="outline-container-org0935ffb" class="outline-4">
<h4 id="org0935ffb"><span class="section-number-4">8.2.2</span> <a href="playground/akka-cookbook/src/main/resources/application-cluster-2.conf">application-cluster-2.conf</a></h4>
</div>
<div id="outline-container-org547a188" class="outline-4">
<h4 id="org547a188"><span class="section-number-4">8.2.3</span> <a href="playground/akka-cookbook/src/main/scala/io/github/gpetri/ch7/NotificationPublisher.scala">NotificationPublisher.scala</a></h4>
</div>
<div id="outline-container-org3d26048" class="outline-4">
<h4 id="org3d26048"><span class="section-number-4">8.2.4</span> <a href="playground/akka-cookbook/src/main/scala/io/github/gpetri/ch7/NotificationSubscriber.scala">NotificationSubscriber.scala</a></h4>
</div>
<div id="outline-container-orgd0fa400" class="outline-4">
<h4 id="orgd0fa400"><span class="section-number-4">8.2.5</span> <a href="playground/akka-cookbook/src/main/scala/io/github/gpetri/ch7/DistributedPubSubApplication.scala">DistributedPubSubApplication.scala</a></h4>
</div>
<div id="outline-container-orgb7ff416" class="outline-4">
<h4 id="orgb7ff416"><span class="section-number-4">8.2.6</span> </h4>
<div class="outline-text-4" id="text-8-2-6">
<div class="org-src-container">
<pre class="src src-bash">sbt -Dconfig.resource=application-cluster-1.conf <span style="color: #EEDC82; font-size: 9.959999999999999pt;">"runMain io.github.gpetri.ch7.DistributedPubSubApplication"</span> 
sbt -Dconfig.resource=application-cluster-2.conf <span style="color: #EEDC82; font-size: 9.959999999999999pt;">"runMain io.github.gpetri.ch7.DistributedPubSubApplication"</span> </pre>
</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-org32eb057" class="outline-3">
<h3 id="org32eb057"><span class="section-number-3">8.3</span> Sharding</h3>
<div class="outline-text-3" id="text-8-3">
</div>
<div id="outline-container-org43ceb87" class="outline-4">
<h4 id="org43ceb87"><span class="section-number-4">8.3.1</span> <a href="playground/akka-cookbook/src/main/resources/application-cluster-shrading-1.conf">application-cluster-shrading-1.conf</a></h4>
</div>
<div id="outline-container-org0e170b0" class="outline-4">
<h4 id="org0e170b0"><span class="section-number-4">8.3.2</span> <a href="playground/akka-cookbook/src/main/resources/application-cluster-shrading-2.conf">application-cluster-shrading-2.conf</a></h4>
</div>
<div id="outline-container-org4ee27e7" class="outline-4">
<h4 id="org4ee27e7"><span class="section-number-4">8.3.3</span> <a href="playground/akka-cookbook/src/main/scala/io/github/gpetri/ch7/TemperatureActor.scala">TemperatureActor.scala</a></h4>
</div>
<div id="outline-container-org509b47a" class="outline-4">
<h4 id="org509b47a"><span class="section-number-4">8.3.4</span> <a href="playground/akka-cookbook/src/main/scala/io/github/gpetri/ch7/ClusterShardingApplication.scala">ClusterShardingApplication.scala</a></h4>
</div>
<div id="outline-container-org2617274" class="outline-4">
<h4 id="org2617274"><span class="section-number-4">8.3.5</span> </h4>
<div class="outline-text-4" id="text-8-3-5">
<div class="org-src-container">
<pre class="src src-bash">sbt -Dconfig.resource=application-cluster-sharding-1.conf <span style="color: #EEDC82; font-size: 9.959999999999999pt;">"runMain io.github.gpetri.ch7.ClusterShardingApplication"</span> 
sbt -Dconfig.resource=application-cluster-sharding-2.conf <span style="color: #EEDC82; font-size: 9.959999999999999pt;">"runMain io.github.gpetri.ch7.ClusterShardingApplication"</span> </pre>
</pre>
</div>
</div>
</div>
</div>
</div>
<div id="outline-container-org4b7194a" class="outline-2">
<h2 id="org4b7194a"><span class="section-number-2">9</span> Akka Patterns</h2>
<div class="outline-text-2" id="text-9">
</div>
<div id="outline-container-org806c115" class="outline-3">
<h3 id="org806c115"><span class="section-number-3">9.1</span> Master/Slave</h3>
<div class="outline-text-3" id="text-9-1">
</div>
<div id="outline-container-org1a220b5" class="outline-4">
<h4 id="org1a220b5"><span class="section-number-4">9.1.1</span> <a href="playground/akka-cookbook/src/main/scala/io/github/gpetri/ch10/MasterWorkPulling.scala">MasterWorkPulling.scala</a></h4>
</div>
<div id="outline-container-org8986a6b" class="outline-4">
<h4 id="org8986a6b"><span class="section-number-4">9.1.2</span> <a href="playground/akka-cookbook/src/main/scala/io/github/gpetri/ch10/WorkerWorkPulling.scala">WorkerWorkPulling.scala</a></h4>
</div>
<div id="outline-container-org2d04de4" class="outline-4">
<h4 id="org2d04de4"><span class="section-number-4">9.1.3</span> <a href="playground/akka-cookbook/src/main/scala/io/github/gpetri/ch10/GeneratorWorkPulling.scala">GeneratorWorkPulling.scala</a></h4>
</div>
<div id="outline-container-org9de3663" class="outline-4">
<h4 id="org9de3663"><span class="section-number-4">9.1.4</span> <a href="playground/akka-cookbook/src/main/scala/io/github/gpetri/ch10/WorkPullingApp.scala">WorkerPullingApp.scala</a></h4>
</div>
<div id="outline-container-org6bda152" class="outline-4">
<h4 id="org6bda152"><span class="section-number-4">9.1.5</span> </h4>
<div class="outline-text-4" id="text-9-1-5">
<div class="org-src-container">
<pre class="src src-bash">sbt <span style="color: #EEDC82; font-size: 9.959999999999999pt;">"runMain io.github.gpetri.ch10.WorkPullingApp"</span></pre>
</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-org3f577ef" class="outline-3">
<h3 id="org3f577ef"><span class="section-number-3">9.2</span> Ordered Termination</h3>
<div class="outline-text-3" id="text-9-2">
</div>
<div id="outline-container-orgd1fa6b3" class="outline-4">
<h4 id="orgd1fa6b3"><span class="section-number-4">9.2.1</span> <a href="playground/akka-cookbook/src/main/scala/io/github/gpetri/ch10/ServiceHandler.scala">ServiceHandler.scala</a></h4>
</div>
<div id="outline-container-org6e70c38" class="outline-4">
<h4 id="org6e70c38"><span class="section-number-4">9.2.2</span> <a href="playground/akka-cookbook/src/main/scala/io/github/gpetri/ch10/ServicesManager.scala">ServiceManager.scala</a></h4>
</div>
<div id="outline-container-orge4e2680" class="outline-4">
<h4 id="orge4e2680"><span class="section-number-4">9.2.3</span> <a href="playground/akka-cookbook/src/main/scala/io/github/gpetri/ch10/OrderedKiller.scala">OrderedKiller.scala</a></h4>
</div>
<div id="outline-container-org8746981" class="outline-4">
<h4 id="org8746981"><span class="section-number-4">9.2.4</span> <a href="playground/akka-cookbook/src/main/scala/io/github/gpetri/ch10/OrderedTerminationApp.scala">OrderedTerminationApp.scala</a></h4>
</div>
<div id="outline-container-org9fdbe80" class="outline-4">
<h4 id="org9fdbe80"><span class="section-number-4">9.2.5</span> </h4>
<div class="outline-text-4" id="text-9-2-5">
<div class="org-src-container">
<pre class="src src-bash">sbt <span style="color: #EEDC82; font-size: 9.959999999999999pt;">"runMain io.github.gpetri.ch10.OrderedTerminationApp"</span></pre>
</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-org0c83c8f" class="outline-3">
<h3 id="org0c83c8f"><span class="section-number-3">9.3</span> Shutdown</h3>
<div class="outline-text-3" id="text-9-3">
</div>
<div id="outline-container-org1fc9532" class="outline-4">
<h4 id="org1fc9532"><span class="section-number-4">9.3.1</span> <a href="playground/akka-cookbook/src/main/scala/io/github/gpetri/ch10/Reaper.scala">Reaper.scala</a></h4>
</div>
<div id="outline-container-org28da48c" class="outline-4">
<h4 id="org28da48c"><span class="section-number-4">9.3.2</span> <a href="playground/akka-cookbook/src/main/scala/io/github/gpetri/ch10/ReaperAwareActor.scala">ReaperAwareActor.scala</a></h4>
</div>
<div id="outline-container-orgd4ad6a0" class="outline-4">
<h4 id="orgd4ad6a0"><span class="section-number-4">9.3.3</span> <a href="playground/akka-cookbook/src/main/scala/io/github/gpetri/ch10/ShutdownPatternWorker.scala">ShutdownPatternWorker.scala</a></h4>
</div>
<div id="outline-container-org54e34b1" class="outline-4">
<h4 id="org54e34b1"><span class="section-number-4">9.3.4</span> <a href="playground/akka-cookbook/src/main/scala/io/github/gpetri/ch10/ShutdownPatternMaster.scala">ShutdownPatternMaster.scala</a></h4>
</div>
<div id="outline-container-orgf4a999b" class="outline-4">
<h4 id="orgf4a999b"><span class="section-number-4">9.3.5</span> <a href="playground/akka-cookbook/src/main/scala/io/github/gpetri/ch10/ShutdownPatternApp.scala">ShutdownPatternApp.scala</a></h4>
</div>
<div id="outline-container-orgc8c2a86" class="outline-4">
<h4 id="orgc8c2a86"><span class="section-number-4">9.3.6</span> </h4>
<div class="outline-text-4" id="text-9-3-6">
<div class="org-src-container">
<pre class="src src-bash">sbt <span style="color: #EEDC82; font-size: 9.959999999999999pt;">"runMain io.github.gpetri.ch10.ShutdownPatternApp"</span></pre>
</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-orgcf4b94b" class="outline-3">
<h3 id="orgcf4b94b"><span class="section-number-3">9.4</span> LoadBalancing</h3>
<div class="outline-text-3" id="text-9-4">
</div>
<div id="outline-container-org0e6866d" class="outline-4">
<h4 id="org0e6866d"><span class="section-number-4">9.4.1</span> <a href="playground/akka-cookbook/src/main/scala/io/github/gpetri/ch10/BalancedWorker.scala">BalancedWorker.scala</a></h4>
</div>
<div id="outline-container-org8f4cf6e" class="outline-4">
<h4 id="org8f4cf6e"><span class="section-number-4">9.4.2</span> <a href="playground/akka-cookbook/src/main/scala/io/github/gpetri/ch10/BalancingWorkApp.scala">BalancingWorkApp.scala</a></h4>
</div>
