DNA-2019/CloudC-publish/Demos.org
*** 
#+BEGIN_SRC bash
sbt "runMain io.github.gpetri.ch10.BalancingDispatcherApp"
#+END_SRC
#+BEGIN_SRC bash
sbt "runMain io.github.gpetri.ch10.SmallestMailboxRouterApp"
#+END_SRC
** Finite State Machine
*** [[file:playground/akka-cookbook/src/main/scala/io/github/gpetri/ch10/FSMChangeSubscriber.scala][FSMChangeSubscriber.scala]]
*** [[file:playground/akka-cookbook/src/main/scala/io/github/gpetri/ch10/TrafficLightFSM.scala][TrafficLightFSM.scala]]
*** [[file:playground/akka-cookbook/src/main/scala/io/github/gpetri/ch10/FSMApp.scala][FSMApp.scala]]
*** 
#+BEGIN_SRC bash
sbt "runMain io.github.gpetri.ch10.FSMApp"
#+END_SRC
** Enveloping
*** [[file:playground/akka-cookbook/src/main/scala/io/github/gpetri/ch10/EnvelopeReceiver.scala][EnvelopeReceive.scala]]
*** [[file:playground/akka-cookbook/src/main/scala/io/github/gpetri/ch10/EnvelopingActor.scala][EnvelopingActor.scala]]
*** [[file:playground/akka-cookbook/src/main/scala/io/github/gpetri/ch10/EnvelopingActorApp.scala][EnvelopingActorApp.scala]]
*** 
#+BEGIN_SRC bash
sbt "runMain io.github.gpetri.ch10.EnvelopingActorApp"
#+END_SRC
* Akka in a Docker Image
** Create a standalone application (.jar)
#+BEGIN_SRC bash
sbt clean assembly
#+END_SRC
** Create a Docker image
*** copy the jar to a different directory 
#+BEGIN_SRC bash
cp target/scala-2.12/akka-cookbook-assembly-0.1.0-SNAPSHOT.jar docker/akka-app.jar
java -cp akka-app.jar gfp.ch1.AkkaActorSystem
#+END_SRC
*** Create a [[file:playground/akka-cookbook/docker/Dockerfile][Dockerfile]]
*** Create a Docker image
#+BEGIN_SRC bash
docker build -t akka-app .
#+END_SRC
*** Run a container with the image
#+BEGIN_SRC bash
docker run -it akka-app
#+END_SRC
*** Stop/Remove the container and remove the image
#+BEGIN_SRC bash
docker rm (docker ps -aq)
docker rmi akka-app
#+END_SRC
* Launch EC2 instances
** [[file:aws-demo/README.org][Start an AWS instance]]
* Akka on EC2
** [[file:playground/akka-ec2/src/main/scala/net/chrisloy/akka/AkkaConfig.scala][AkkaConfig.scala]]
** [[file:playground/akka-ec2/src/main/scala/net/chrisloy/akka/EC2.scala][EC2.scala]]
** [[file:playground/akka-ec2/src/main/scala/net/chrisloy/akka/BroadcastActor.scala][BroadcastActor.scala]]
** [[file:playground/akka-ec2/src/main/scala/net/chrisloy/akka/Main.scala][Main.scala]]
** Compile
#+BEGIN_SRC bash
sbt clean
sbt assembly
#+END_SRC
** Run Locally
#+BEGIN_SRC bash
java -jar -Dakka.port=2551 target/scala-2.12/akka-ec2-assembly-0.1.0-SNAPSHOT.jar
java -jar -Dakka.port=2552 target/scala-2.12/akka-ec2-assembly-0.1.0-SNAPSHOT.jar
java -jar -Dakka.port=2553 target/scala-2.12/akka-ec2-assembly-0.1.0-SNAPSHOT.jar
java -jar -Dakka.port=2554 target/scala-2.12/akka-ec2-assembly-0.1.0-SNAPSHOT.jar
#+END_SRC
** Run in an EC2 Autoscaling Group
*** Go to EC2 Autoscaling Gropus ([[https://eu-west-1.console.aws.amazon.com/ec2/autoscaling/home?region=eu-west-1#AutoScalingGroups:id=akka-ec2-group;view=details][EC2 Management Console]])
*** Increment the desired/min/max instance count
*** Navitage to Running Instances ([[https://eu-west-1.console.aws.amazon.com/ec2/v2/home?region=eu-west-1#Instances:sort=instanceId][EC2 Management Console]])
*** Get public IP addresses of running instances and install java
**** log in and install java
#+BEGIN_SRC bash
ssh -i /Users/guspet02/teaching/2019/DNA/CloudC/aws-demo/Dna-Demo.pem ec2-user@54.229.247.127
sudo yum -y install java-1.8.0-openjdk.x86_64
#+END_SRC
*** Copy the .jar file to each of the instances
**** 
#+BEGIN_SRC bash
scp -i /Users/guspet02/teaching/2019/DNA/CloudC/aws-demo/Dna-Demo.pem target/scala-2.12/akka-ec2-assembly-0.1.0-SNAPSHOT.jar  ec2-user@54.229.247.127:~/
#+END_SRC
*** Launch the application in each of the instances
**** 
#+BEGIN_SRC bash
ssh -i /Users/guspet02/teaching/2019/DNA/CloudC/aws-demo/Dna-Demo.pem ec2-user@54.229.247.127
java -jar akka-ec2-assembly-0.1.0-SNAPSHOT.jar
#+END_SRC
*** Add a new node and repeat
*** Shutdown the scaling group
* Akka on Docker
** Explore the application:
*** [[file:playground/activator-akka-docker/src/main/scala/com/example/Main.scala][Main.scala]]
