DNA-2019/CloudC-publish/Demos.html
<div id="outline-container-org3e2ca3f" class="outline-4">
<h4 id="org3e2ca3f"><span class="section-number-4">9.4.3</span> </h4>
<div class="outline-text-4" id="text-9-4-3">
<div class="org-src-container">
<pre class="src src-bash">sbt <span style="color: #EEDC82; font-size: 9.959999999999999pt;">"runMain io.github.gpetri.ch10.BalancingDispatcherApp"</span></pre>
</pre>
</div>
<div class="org-src-container">
<pre class="src src-bash">sbt <span style="color: #EEDC82; font-size: 9.959999999999999pt;">"runMain io.github.gpetri.ch10.SmallestMailboxRouterApp"</span></pre>
</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-org9205ab3" class="outline-3">
<h3 id="org9205ab3"><span class="section-number-3">9.5</span> Finite State Machine</h3>
<div class="outline-text-3" id="text-9-5">
</div>
<div id="outline-container-orge136f91" class="outline-4">
<h4 id="orge136f91"><span class="section-number-4">9.5.1</span> <a href="playground/akka-cookbook/src/main/scala/io/github/gpetri/ch10/FSMChangeSubscriber.scala">FSMChangeSubscriber.scala</a></h4>
</div>
<div id="outline-container-org3c7a1c6" class="outline-4">
<h4 id="org3c7a1c6"><span class="section-number-4">9.5.2</span> <a href="playground/akka-cookbook/src/main/scala/io/github/gpetri/ch10/TrafficLightFSM.scala">TrafficLightFSM.scala</a></h4>
</div>
<div id="outline-container-org14f39b2" class="outline-4">
<h4 id="org14f39b2"><span class="section-number-4">9.5.3</span> <a href="playground/akka-cookbook/src/main/scala/io/github/gpetri/ch10/FSMApp.scala">FSMApp.scala</a></h4>
</div>
<div id="outline-container-orga45c64c" class="outline-4">
<h4 id="orga45c64c"><span class="section-number-4">9.5.4</span> </h4>
<div class="outline-text-4" id="text-9-5-4">
<div class="org-src-container">
<pre class="src src-bash">sbt <span style="color: #EEDC82; font-size: 9.959999999999999pt;">"runMain io.github.gpetri.ch10.FSMApp"</span></pre>
</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-org9edae37" class="outline-3">
<h3 id="org9edae37"><span class="section-number-3">9.6</span> Enveloping</h3>
<div class="outline-text-3" id="text-9-6">
</div>
<div id="outline-container-org0faa228" class="outline-4">
<h4 id="org0faa228"><span class="section-number-4">9.6.1</span> <a href="playground/akka-cookbook/src/main/scala/io/github/gpetri/ch10/EnvelopeReceiver.scala">EnvelopeReceive.scala</a></h4>
</div>
<div id="outline-container-orgadc5ecf" class="outline-4">
<h4 id="orgadc5ecf"><span class="section-number-4">9.6.2</span> <a href="playground/akka-cookbook/src/main/scala/io/github/gpetri/ch10/EnvelopingActor.scala">EnvelopingActor.scala</a></h4>
</div>
<div id="outline-container-orga87aeb1" class="outline-4">
<h4 id="orga87aeb1"><span class="section-number-4">9.6.3</span> <a href="playground/akka-cookbook/src/main/scala/io/github/gpetri/ch10/EnvelopingActorApp.scala">EnvelopingActorApp.scala</a></h4>
</div>
<div id="outline-container-orga414462" class="outline-4">
<h4 id="orga414462"><span class="section-number-4">9.6.4</span> </h4>
<div class="outline-text-4" id="text-9-6-4">
<div class="org-src-container">
<pre class="src src-bash">sbt <span style="color: #EEDC82; font-size: 9.959999999999999pt;">"runMain io.github.gpetri.ch10.EnvelopingActorApp"</span></pre>
</pre>
</div>
</div>
</div>
</div>
</div>
<div id="outline-container-org872367d" class="outline-2">
<h2 id="org872367d"><span class="section-number-2">10</span> Akka in a Docker Image</h2>
<div class="outline-text-2" id="text-10">
</div>
<div id="outline-container-org5f8eb77" class="outline-3">
<h3 id="org5f8eb77"><span class="section-number-3">10.1</span> Create a standalone application (.jar)</h3>
<div class="outline-text-3" id="text-10-1">
<div class="org-src-container">
<pre class="src src-bash">sbt clean assembly</pre>
</pre>
</div>
</div>
</div>
<div id="outline-container-org5502ca1" class="outline-3">
<h3 id="org5502ca1"><span class="section-number-3">10.2</span> Create a Docker image</h3>
<div class="outline-text-3" id="text-10-2">
</div>
<div id="outline-container-org5ab9641" class="outline-4">
<h4 id="org5ab9641"><span class="section-number-4">10.2.1</span> copy the jar to a different directory</h4>
<div class="outline-text-4" id="text-10-2-1">
<div class="org-src-container">
<pre class="src src-bash">cp target/scala-2.12/akka-cookbook-assembly-0.1.0-SNAPSHOT.jar docker/akka-app.jar
java -cp akka-app.jar gfp.ch1.AkkaActorSystem</pre>
</pre>
</div>
</div>
</div>
<div id="outline-container-orgf899f78" class="outline-4">
<h4 id="orgf899f78"><span class="section-number-4">10.2.2</span> Create a <a href="playground/akka-cookbook/docker/Dockerfile">Dockerfile</a></h4>
</div>
<div id="outline-container-org07db542" class="outline-4">
<h4 id="org07db542"><span class="section-number-4">10.2.3</span> Create a Docker image</h4>
<div class="outline-text-4" id="text-10-2-3">
<div class="org-src-container">
<pre class="src src-bash">docker build -t akka-app .</pre>
</pre>
</div>
</div>
</div>
<div id="outline-container-org9608cac" class="outline-4">
<h4 id="org9608cac"><span class="section-number-4">10.2.4</span> Run a container with the image</h4>
<div class="outline-text-4" id="text-10-2-4">
<div class="org-src-container">
<pre class="src src-bash">docker run -it akka-app</pre>
</pre>
</div>
</div>
</div>
<div id="outline-container-org7865be6" class="outline-4">
<h4 id="org7865be6"><span class="section-number-4">10.2.5</span> Stop/Remove the container and remove the image</h4>
<div class="outline-text-4" id="text-10-2-5">
<div class="org-src-container">
<pre class="src src-bash">docker rm <span style="color: #ff8c00; font-size: 9.959999999999999pt;">(</span>docker ps -aq<span style="color: #ff8c00; font-size: 9.959999999999999pt;">)</span>
docker rmi akka-app</pre>
</pre>
</div>
</div>
</div>
</div>
</div>
<div id="outline-container-org0961dc0" class="outline-2">
<h2 id="org0961dc0"><span class="section-number-2">11</span> Launch EC2 instances</h2>
<div class="outline-text-2" id="text-11">
</div>
<div id="outline-container-org532c743" class="outline-3">
<h3 id="org532c743"><span class="section-number-3">11.1</span> <a href="aws-demo/README.html">Start an AWS instance</a></h3>
</div>
</div>
<div id="outline-container-orge2d4fa6" class="outline-2">
<h2 id="orge2d4fa6"><span class="section-number-2">12</span> Akka on EC2</h2>
<div class="outline-text-2" id="text-12">
</div>
<div id="outline-container-org188d9dc" class="outline-3">
<h3 id="org188d9dc"><span class="section-number-3">12.1</span> <a href="playground/akka-ec2/src/main/scala/net/chrisloy/akka/AkkaConfig.scala">AkkaConfig.scala</a></h3>
</div>
<div id="outline-container-orgb17de65" class="outline-3">
<h3 id="orgb17de65"><span class="section-number-3">12.2</span> <a href="playground/akka-ec2/src/main/scala/net/chrisloy/akka/EC2.scala">EC2.scala</a></h3>
</div>
<div id="outline-container-orgede18c3" class="outline-3">
<h3 id="orgede18c3"><span class="section-number-3">12.3</span> <a href="playground/akka-ec2/src/main/scala/net/chrisloy/akka/BroadcastActor.scala">BroadcastActor.scala</a></h3>
</div>
<div id="outline-container-orge485cba" class="outline-3">
<h3 id="orge485cba"><span class="section-number-3">12.4</span> <a href="playground/akka-ec2/src/main/scala/net/chrisloy/akka/Main.scala">Main.scala</a></h3>
</div>
<div id="outline-container-org2f66691" class="outline-3">
<h3 id="org2f66691"><span class="section-number-3">12.5</span> Compile</h3>
<div class="outline-text-3" id="text-12-5">
<div class="org-src-container">
<pre class="src src-bash">sbt clean
sbt assembly</pre>
</pre>
</div>
</div>
</div>
<div id="outline-container-org96e989b" class="outline-3">
<h3 id="org96e989b"><span class="section-number-3">12.6</span> Run Locally</h3>
<div class="outline-text-3" id="text-12-6">
<div class="org-src-container">
<pre class="src src-bash">java -jar -Dakka.port=2551 target/scala-2.12/akka-ec2-assembly-0.1.0-SNAPSHOT.jar
java -jar -Dakka.port=2552 target/scala-2.12/akka-ec2-assembly-0.1.0-SNAPSHOT.jar
java -jar -Dakka.port=2553 target/scala-2.12/akka-ec2-assembly-0.1.0-SNAPSHOT.jar
java -jar -Dakka.port=2554 target/scala-2.12/akka-ec2-assembly-0.1.0-SNAPSHOT.jar</pre>
</pre>
</div>
</div>
</div>
<div id="outline-container-org83791bf" class="outline-3">
<h3 id="org83791bf"><span class="section-number-3">12.7</span> Run in an EC2 Autoscaling Group</h3>
<div class="outline-text-3" id="text-12-7">
</div>
<div id="outline-container-orgb2973c1" class="outline-4">
<h4 id="orgb2973c1"><span class="section-number-4">12.7.1</span> Go to EC2 Autoscaling Gropus (<a href="https://eu-west-1.console.aws.amazon.com/ec2/autoscaling/home?region=eu-west-1#AutoScalingGroups:id=akka-ec2-group;view=details">EC2 Management Console</a>)</h4>
</div>
<div id="outline-container-org0965399" class="outline-4">
<h4 id="org0965399"><span class="section-number-4">12.7.2</span> Increment the desired/min/max instance count</h4>
</div>
<div id="outline-container-org6b3da02" class="outline-4">
<h4 id="org6b3da02"><span class="section-number-4">12.7.3</span> Navitage to Running Instances (<a href="https://eu-west-1.console.aws.amazon.com/ec2/v2/home?region=eu-west-1#Instances:sort=instanceId">EC2 Management Console</a>)</h4>
</div>
<div id="outline-container-orge52dd6e" class="outline-4">
<h4 id="orge52dd6e"><span class="section-number-4">12.7.4</span> Get public IP addresses of running instances and install java</h4>
<div class="outline-text-4" id="text-12-7-4">
</div>
<ol class="org-ol">
<li><a id="orgc3a5544"></a>log in and install java<br />
<div class="outline-text-5" id="text-12-7-4-1">
<div class="org-src-container">
<pre class="src src-bash">ssh -i /Users/guspet02/teaching/2019/DNA/CloudC/aws-demo/Dna-Demo.pem ec2-user@54.229.247.127
sudo yum -y install java-1.8.0-openjdk.x86_64</pre>
</pre>
</div>
</div>
</li>
</ol>
</div>
<div id="outline-container-orgca1fdcb" class="outline-4">
<h4 id="orgca1fdcb"><span class="section-number-4">12.7.5</span> Copy the .jar file to each of the instances</h4>
<div class="outline-text-4" id="text-12-7-5">
</div>
<ol class="org-ol">
<li><a id="orgd825d13"></a><br />
<div class="outline-text-5" id="text-12-7-5-1">
<div class="org-src-container">
<pre class="src src-bash">scp -i /Users/guspet02/teaching/2019/DNA/CloudC/aws-demo/Dna-Demo.pem target/scala-2.12/akka-ec2-assembly-0.1.0-SNAPSHOT.jar  ec2-user@54.229.247.127:~/</pre>
</pre>
</div>
</div>
</li>
</ol>
</div>
<div id="outline-container-org4b52f1e" class="outline-4">
<h4 id="org4b52f1e"><span class="section-number-4">12.7.6</span> Launch the application in each of the instances</h4>
<div class="outline-text-4" id="text-12-7-6">
</div>
<ol class="org-ol">
<li><a id="org92c1a5b"></a><br />
<div class="outline-text-5" id="text-12-7-6-1">
<div class="org-src-container">
<pre class="src src-bash">ssh -i /Users/guspet02/teaching/2019/DNA/CloudC/aws-demo/Dna-Demo.pem ec2-user@54.229.247.127
java -jar akka-ec2-assembly-0.1.0-SNAPSHOT.jar</pre>
</pre>
</div>
</div>
</li>
</ol>
</div>
<div id="outline-container-org003b739" class="outline-4">
<h4 id="org003b739"><span class="section-number-4">12.7.7</span> Add a new node and repeat</h4>
</div>
<div id="outline-container-orgd74ffbc" class="outline-4">
<h4 id="orgd74ffbc"><span class="section-number-4">12.7.8</span> Shutdown the scaling group</h4>
</div>
</div>
</div>
<div id="outline-container-org636f4df" class="outline-2">
<h2 id="org636f4df"><span class="section-number-2">13</span> Akka on Docker</h2>
<div class="outline-text-2" id="text-13">
</div>
<div id="outline-container-org6155e2e" class="outline-3">
<h3 id="org6155e2e"><span class="section-number-3">13.1</span> Explore the application:</h3>
<div class="outline-text-3" id="text-13-1">
</div>
