DNA-2019/CloudC-publish/Demos.org
*** Create the docker image
#+BEGIN_SRC bash
sbt docker:publishLocal
#+END_SRC
*** List image names and pick the right image
#+BEGIN_SRC bash
docker images
#+END_SRC
*** Start a first seed node and get the seed node ip
#+BEGIN_SRC bash
docker run --name seed-1 akka-docker:2.3.10 --seed
docker exec -it seed-1 ip addr show
#+END_SRC
*** Start a second seed node using the address of the first one as a seed
#+BEGIN_SRC bash
docker run --name seed-2 akka-docker:2.3.10 --seed 172.17.0.2:2551
docker exec -it seed-2 ip addr show
#+END_SRC
*** Start as many worker nodes as necessary
#+BEGIN_SRC bash
docker run --name node-1 akka-docker:2.3.10 172.17.0.2:2551 172.17.0.3:2551
docker run --name node-2 akka-docker:2.3.10 172.17.0.2:2551 172.17.0.3:2551
#+END_SRC
*** Remove all the nodes
#+BEGIN_SRC bash
docker rm (docker ps -aq)
#+END_SRC
* Akka on Kubernetes
** [[file:playground/akka-k8s/akka-simple-cluster-k8s/src/main/scala/com/softwaremill/akkaSimpleCluster/Main.scala][Main.scala]]
** k8s
*** [[file:playground/akka-k8s/akka-simple-cluster-k8s/k8s/simple-akka-cluster-deployment.yml][simple-akka-cluster-deployment.yml]]
*** [[file:playground/akka-k8s/akka-simple-cluster-k8s/k8s/simple-akka-cluster-rbac.yml][simple-akka-cluster-rbac.yml]]
*** [[file:playground/akka-k8s/akka-simple-cluster-k8s/k8s/simple-akka-cluster-service.yml][simple-akka-cluster-service.yml]]
** Running the application on Minikube
*** Start the minikube (Simulates a kuberenetes equipped cluster) and link to its docker engine
#+BEGIN_SRC bash
minikube start
eval (minikube docker-env)
#+END_SRC
*** Publish the docker images to the minikube 
#+BEGIN_SRC bash
sbt docker:publishLocal
docker images
#+END_SRC
*** Create a service account and role in kuberenetes
#+BEGIN_SRC bash
kubectl create -f k8s/simple-akka-cluster-rbac.yml
#+END_SRC
*** Create a deployment
#+BEGIN_SRC bash
kubectl create -f k8s/simple-akka-cluster-deployment.yml
#+END_SRC
*** Create a service
#+BEGIN_SRC bash
kubectl create -f k8s/simple-akka-cluster-service.yml
#+END_SRC
*** Open minikube's dashboard
#+BEGIN_SRC bash
minikube dashboard
#+END_SRC
*** Get the port of the akka http management API
#+BEGIN_SRC bash
MANAGEMENT_PORT=(kubectl get svc akka-simple-cluster -ojsonpath="{.spec.ports[?(@.name==\"management\")].nodePort}")
curl http://(minikube ip):$MANAGEMENT_PORT/cluster/members | jq
#+END_SRC
* Replicated Data
** CRDTs
*** [[file:playground/akka-cookbook/src/main/scala/io/github/gpetri/ch7/SusbcriptionManager.scala][SubscriptionManager.scala]]
*** [[file:playground/akka-cookbook/src/main/scala/io/github/gpetri/ch7/DistributedDataApplication.scala][DistributedDataApplication.scala]]
*** 
#+BEGIN_SRC bash
sbt -Dconfig.resource=application-cluster-1.conf "runMain io.github.gpetri.ch7.DistributedDataApplication" 
sbt -Dconfig.resource=application-cluster-2.conf "runMain io.github.gpetri.ch7.DistributedDataApplication" 
#+END_SRC 
