DNA-2019/CloudC-publish/Demos.html
<div id="outline-container-org3e0e1b2" class="outline-4">
<h4 id="org3e0e1b2"><span class="section-number-4">13.1.1</span> <a href="playground/activator-akka-docker/src/main/scala/com/example/Main.scala">Main.scala</a></h4>
</div>
<div id="outline-container-org3b8cc0e" class="outline-4">
<h4 id="org3b8cc0e"><span class="section-number-4">13.1.2</span> Create the docker image</h4>
<div class="outline-text-4" id="text-13-1-2">
<div class="org-src-container">
<pre class="src src-bash">sbt docker:publishLocal</pre>
</pre>
</div>
</div>
</div>
<div id="outline-container-org6ff1ffe" class="outline-4">
<h4 id="org6ff1ffe"><span class="section-number-4">13.1.3</span> List image names and pick the right image</h4>
<div class="outline-text-4" id="text-13-1-3">
<div class="org-src-container">
<pre class="src src-bash">docker images</pre>
</pre>
</div>
</div>
</div>
<div id="outline-container-org8ca26f9" class="outline-4">
<h4 id="org8ca26f9"><span class="section-number-4">13.1.4</span> Start a first seed node and get the seed node ip</h4>
<div class="outline-text-4" id="text-13-1-4">
<div class="org-src-container">
<pre class="src src-bash">docker run --name seed-1 akka-docker:2.3.10 --seed
docker exec -it seed-1 ip addr show</pre>
</pre>
</div>
</div>
</div>
<div id="outline-container-org29bd137" class="outline-4">
<h4 id="org29bd137"><span class="section-number-4">13.1.5</span> Start a second seed node using the address of the first one as a seed</h4>
<div class="outline-text-4" id="text-13-1-5">
<div class="org-src-container">
<pre class="src src-bash">docker run --name seed-2 akka-docker:2.3.10 --seed 172.17.0.2:2551
docker exec -it seed-2 ip addr show</pre>
</pre>
</div>
</div>
</div>
<div id="outline-container-orgb3b2d28" class="outline-4">
<h4 id="orgb3b2d28"><span class="section-number-4">13.1.6</span> Start as many worker nodes as necessary</h4>
<div class="outline-text-4" id="text-13-1-6">
<div class="org-src-container">
<pre class="src src-bash">docker run --name node-1 akka-docker:2.3.10 172.17.0.2:2551 172.17.0.3:2551
docker run --name node-2 akka-docker:2.3.10 172.17.0.2:2551 172.17.0.3:2551</pre>
</pre>
</div>
</div>
</div>
<div id="outline-container-orgdc497e0" class="outline-4">
<h4 id="orgdc497e0"><span class="section-number-4">13.1.7</span> Remove all the nodes</h4>
<div class="outline-text-4" id="text-13-1-7">
<div class="org-src-container">
<pre class="src src-bash">docker rm <span style="color: #ff8c00; font-size: 9.959999999999999pt;">(</span>docker ps -aq<span style="color: #ff8c00; font-size: 9.959999999999999pt;">)</span></pre>
</pre>
</div>
</div>
</div>
</div>
</div>
<div id="outline-container-org2470718" class="outline-2">
<h2 id="org2470718"><span class="section-number-2">14</span> Akka on Kubernetes</h2>
<div class="outline-text-2" id="text-14">
</div>
<div id="outline-container-org07e6492" class="outline-3">
<h3 id="org07e6492"><span class="section-number-3">14.1</span> <a href="playground/akka-k8s/akka-simple-cluster-k8s/src/main/scala/com/softwaremill/akkaSimpleCluster/Main.scala">Main.scala</a></h3>
</div>
<div id="outline-container-org1bf4556" class="outline-3">
<h3 id="org1bf4556"><span class="section-number-3">14.2</span> k8s</h3>
<div class="outline-text-3" id="text-14-2">
</div>
<div id="outline-container-orgbe192b9" class="outline-4">
<h4 id="orgbe192b9"><span class="section-number-4">14.2.1</span> <a href="playground/akka-k8s/akka-simple-cluster-k8s/k8s/simple-akka-cluster-deployment.yml">simple-akka-cluster-deployment.yml</a></h4>
</div>
<div id="outline-container-org5288118" class="outline-4">
<h4 id="org5288118"><span class="section-number-4">14.2.2</span> <a href="playground/akka-k8s/akka-simple-cluster-k8s/k8s/simple-akka-cluster-rbac.yml">simple-akka-cluster-rbac.yml</a></h4>
</div>
<div id="outline-container-org7c9598b" class="outline-4">
<h4 id="org7c9598b"><span class="section-number-4">14.2.3</span> <a href="playground/akka-k8s/akka-simple-cluster-k8s/k8s/simple-akka-cluster-service.yml">simple-akka-cluster-service.yml</a></h4>
</div>
</div>
<div id="outline-container-orga7874f9" class="outline-3">
<h3 id="orga7874f9"><span class="section-number-3">14.3</span> Running the application on Minikube</h3>
<div class="outline-text-3" id="text-14-3">
</div>
<div id="outline-container-org320df90" class="outline-4">
<h4 id="org320df90"><span class="section-number-4">14.3.1</span> Start the minikube (Simulates a kuberenetes equipped cluster) and link to its docker engine</h4>
<div class="outline-text-4" id="text-14-3-1">
<div class="org-src-container">
<pre class="src src-bash">minikube start
<span style="color: #FF80F4; font-size: 9.959999999999999pt;">eval</span> <span style="color: #ff8c00; font-size: 9.959999999999999pt;">(</span>minikube docker-env<span style="color: #ff8c00; font-size: 9.959999999999999pt;">)</span></pre>
</pre>
</div>
</div>
</div>
<div id="outline-container-org5b2d8b8" class="outline-4">
<h4 id="org5b2d8b8"><span class="section-number-4">14.3.2</span> Publish the docker images to the minikube</h4>
<div class="outline-text-4" id="text-14-3-2">
<div class="org-src-container">
<pre class="src src-bash">sbt docker:publishLocal
docker images</pre>
</pre>
</div>
</div>
</div>
<div id="outline-container-org3ca7b5c" class="outline-4">
<h4 id="org3ca7b5c"><span class="section-number-4">14.3.3</span> Create a service account and role in kuberenetes</h4>
<div class="outline-text-4" id="text-14-3-3">
<div class="org-src-container">
<pre class="src src-bash">kubectl create -f k8s/simple-akka-cluster-rbac.yml</pre>
</pre>
</div>
</div>
</div>
<div id="outline-container-org93f412f" class="outline-4">
<h4 id="org93f412f"><span class="section-number-4">14.3.4</span> Create a deployment</h4>
<div class="outline-text-4" id="text-14-3-4">
<div class="org-src-container">
<pre class="src src-bash">kubectl create -f k8s/simple-akka-cluster-deployment.yml</pre>
</pre>
</div>
</div>
</div>
<div id="outline-container-org150918d" class="outline-4">
<h4 id="org150918d"><span class="section-number-4">14.3.5</span> Create a service</h4>
<div class="outline-text-4" id="text-14-3-5">
<div class="org-src-container">
<pre class="src src-bash">kubectl create -f k8s/simple-akka-cluster-service.yml</pre>
</pre>
</div>
</div>
</div>
<div id="outline-container-org41c10da" class="outline-4">
<h4 id="org41c10da"><span class="section-number-4">14.3.6</span> Open minikube's dashboard</h4>
<div class="outline-text-4" id="text-14-3-6">
<div class="org-src-container">
<pre class="src src-bash">minikube dashboard</pre>
</pre>
</div>
</div>
</div>
<div id="outline-container-orgdc479a4" class="outline-4">
<h4 id="orgdc479a4"><span class="section-number-4">14.3.7</span> Get the port of the akka http management API</h4>
<div class="outline-text-4" id="text-14-3-7">
<div class="org-src-container">
<pre class="src src-bash"><span style="color: #FD971F; font-size: 9.959999999999999pt;">MANAGEMENT_PORT</span>=<span style="color: #ff8c00; font-size: 9.959999999999999pt;">(</span>kubectl get svc akka-simple-cluster -ojsonpath=<span style="color: #EEDC82; font-size: 9.959999999999999pt;">"{.spec.ports[?(@.name==\"management\")].nodePort}"</span><span style="color: #ff8c00; font-size: 9.959999999999999pt;">)</span>
curl http://<span style="color: #ff8c00; font-size: 9.959999999999999pt;">(</span>minikube ip<span style="color: #ff8c00; font-size: 9.959999999999999pt;">)</span>:$<span style="color: #FD971F; font-size: 9.959999999999999pt;">MANAGEMENT_PORT</span>/cluster/members | jq</pre>
</pre>
</div>
</div>
</div>
</div>
</div>
<div id="outline-container-orgae2132e" class="outline-2">
<h2 id="orgae2132e"><span class="section-number-2">15</span> Replicated Data</h2>
<div class="outline-text-2" id="text-15">
</div>
<div id="outline-container-org3eda70b" class="outline-3">
<h3 id="org3eda70b"><span class="section-number-3">15.1</span> CRDTs</h3>
<div class="outline-text-3" id="text-15-1">
</div>
<div id="outline-container-org1953878" class="outline-4">
<h4 id="org1953878"><span class="section-number-4">15.1.1</span> <a href="playground/akka-cookbook/src/main/scala/io/github/gpetri/ch7/SusbcriptionManager.scala">SubscriptionManager.scala</a></h4>
</div>
<div id="outline-container-org30ec815" class="outline-4">
<h4 id="org30ec815"><span class="section-number-4">15.1.2</span> <a href="playground/akka-cookbook/src/main/scala/io/github/gpetri/ch7/DistributedDataApplication.scala">DistributedDataApplication.scala</a></h4>
</div>
<div id="outline-container-org2838b56" class="outline-4">
<h4 id="org2838b56"><span class="section-number-4">15.1.3</span> </h4>
<div class="outline-text-4" id="text-15-1-3">
<div class="org-src-container">
<pre class="src src-bash">sbt -Dconfig.resource=application-cluster-1.conf <span style="color: #EEDC82; font-size: 9.959999999999999pt;">"runMain io.github.gpetri.ch7.DistributedDataApplication"</span> 
sbt -Dconfig.resource=application-cluster-2.conf <span style="color: #EEDC82; font-size: 9.959999999999999pt;">"runMain io.github.gpetri.ch7.DistributedDataApplication"</span> </pre>
</pre>
</div>
</div>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Gustavo Petri</p>
<p class="date">Created: 2019-03-08 Fri 15:30</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>